navigator.org
#+TITLE: Building a Graph Navigator in Python
#+OPTIONS: ^:{} H:4
#+PROPERTY: header-args :eval no :comments both
#+SETUPFILE: readtheorg-theme.setup

* Contents                                                        :noexport:TOC:
  :PROPERTIES:
  :ID:       214d2c95-94d3-4f6d-b1a7-04f1c7101f0b
  :END:

- [[#introduction][Introduction]]
- [[#targets][Targets]]
- [[#supporting-packages][Supporting packages]]
    - [[#jupyter-widgets][Jupyter Widgets]]
    - [[#cytoscapejs][Cytoscape.js]]
    - [[#shinywidgets][shinywidgets]]
    - [[#ipycytoscape][ipycytoscape]]
    - [[#ipysigma][ipysigma]]
    - [[#pyvis][Pyvis]]
    - [[#d3][D3]]
    - [[#d3blocks][d3blocks]]
    - [[#d3graph][d3graph]]
    - [[#ipydagred3][ipydagred3]]
    - [[#ipyelk][ipyelk]]
    - [[#dash][Dash]]
    - [[#bokeh][Bokeh]]
    - [[#altair][Altair]]
- [[#using-shiny][Using Shiny]]
    - [[#ways-to-extend-shiny][Ways to extend Shiny]]
    - [[#using-cytoscapejs][Using Cytoscape.js]]
    - [[#using-ipysigma][Using ipysigma]]
    - [[#using-pyvis][Using pyvis]]
    - [[#d3-1][D3]]
    - [[#debugging-shiny][Debugging Shiny]]
- [[#utilities][Utilities]]
    - [[#generic-utilities][Generic utilities]]
    - [[#graph-utilities][Graph utilities]]
    - [[#data-providers][Data providers]]
- [[#footnotes][Footnotes]]

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: introduction
  :ID:       9b3f852d-72a3-4d73-917e-d194b748e74d
  :END:

  Developing browser-based applications for
  the exploration and visualization of directed acyclic graphs (DAGs)
  is a significant challenge in Python.
  The combination of web application frameworks like
  Shiny for Python[fn:shiny-overview],
  component frameworks like [[#jupyter-widgets][Jupyter Widgets]], and
  graph visualization libraries integrated with these
  offer an attractive possible solution.
  This report explores using different combinations of packages
  to achieve our goals.

* Targets
  :PROPERTIES:
  :ID:       c3e13b80-f4e8-4fad-8628-be292c39dd26
  :END:
  We want to create an application that, in rough priority order:
  1. Displays a directed acyclic graph
  2. Supports user interactions driving server-side actions
  3. Supports user interactions driving UI elements mediated by server-side code
  4. Supports the above with incremental redrawing of updated UI elements

  Also, our preferred order for architectures is:
  1. Primarily Python and server-side driven, with generated front-end Javascript,
     e.g. Shiny for Python, Bokeh or Plotly Dash.
  2. As above but with R rather than Python (i.e. R Shiny).
  3. Primarily front-end driven, with lightweight Javascript or Typescript calling
     into a mostly separate back-end API written in Python.  A simple D3 or React
     front-end might be a candidate here.
  4. Anything else (e.g. other languages, heavy front-end frameworks).

* Supporting packages

*** Jupyter Widgets
    :PROPERTIES:
    :CUSTOM_ID: jupyter-widgets
    :END:
    Jupyter widgets, also known as ipywidgets, are interactive HTML widgets for Jupyter notebooks.
    They allow developers to create GUI-like elements within notebooks.
    Widgets let users interact with plots, images, and data tables, modify inputs, and see results in real time.
    They include components like sliders, buttons, and text boxes,
    which can link to Python functions and data events, allowing dynamic computation and visualization.

    Application frameworks like Bokeh, Dash, and Shiny for Python support
    using Jupyter widgets to add interaction capabilities.
    This lets developers build browser-based applications with
    the same widget components that are used in Jupyter notebook environments.

*** Cytoscape.js
    :PROPERTIES:
    :ID:       5a82ce91-7533-44d1-a65f-20626b385f5a
    :CUSTOM_ID: cytoscape-js
    :END:

    Cytoscape.js ([[https://js.cytoscape.org/]]) is an open-source JavaScript library
    for visualizing and analyzing network data.
    It serves as a building block for
    creating interactive network visualizations in web browsers[fn:cytoscapejs-and-cytoscape].
    It's optimized, has no external dependencies, and works with most modern browsers.
    Features include pan and zoom, node and edge styling, layout algorithms,
    and support for graph theory algorithms.

    Core to Cytoscape.js is the graph instance, initialized with a DOM container,
    an array of elements (nodes and edges), styling rules, and a layout algorithm.
    It uses a JSON format to represent graph data,
    defining nodes and edges as JavaScript objects
    with unique identifiers and source-target relationships.
    CSS-based styling allows customization of nodes and edges based on data attributes.
    The library provides an API for programmatic interaction, including
    modifying elements, applying layouts, and managing user interactions.
    Numerous examples and demos available online help showcase its capabilities.

*** shinywidgets
    :PROPERTIES:
    :ID:       6a099728-29b8-4127-9328-2ef023ad2d5b
    :CUSTOM_ID: shinywidgets
    :END:

    The shinywidgets Python package (https://shiny.posit.co/py/docs/jupyter-widgets.html)
    enables the integration of ipywidgets (Jupyter Widgets) into Shiny for Python applications.
    It is part of the ipywidgets ecosystem,
    in which popular Python packages provide interactive widgets including:
    - Visualization, with tools like Altair, Bokeh, and Plotly
    - Mapping, featuring Pydeck and ipyleaflet
    - Data display, utilizing ipydatagrid and ipysheet
    - 3D rendering, through ipyvolume and pythreejs
    - Media, with ipywebrtc

    This integration allows for
    seamless rendering, efficient updates, and responsive user interactions
    within Shiny applications using ipywidgets.

