navigator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-06 Wed 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building a Graph Navigator in Python</title>
<meta name="author" content="Jonathan Moore" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/search.css"/>
<link rel="stylesheet" type="text/css" href="src/www/patches.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Building a Graph Navigator in Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#org41a6df8">Targets</a></li>
<li><a href="#org5f18465">Supporting packages</a>
<ul>
<li><a href="#jupyter-widgets">Jupyter Widgets</a></li>
<li><a href="#cytoscape-js">Cytoscape.js</a></li>
<li><a href="#shinywidgets">shinywidgets</a></li>
<li><a href="#ipycytoscape">ipycytoscape</a></li>
<li><a href="#org7e027fa">ipysigma</a></li>
<li><a href="#org9eeb36e">Pyvis</a></li>
<li><a href="#orge697c5e">D3</a></li>
<li><a href="#org222433b">d3blocks</a></li>
<li><a href="#org9bdbafd">d3graph</a></li>
<li><a href="#orgcfb3aad">ipydagred3</a></li>
<li><a href="#orge5bd654">ipyelk</a></li>
<li><a href="#org93b88f0">Dash</a></li>
<li><a href="#orgaedf332">Bokeh</a></li>
<li><a href="#org708aade">Altair</a></li>
</ul>
</li>
<li><a href="#methods-for-creating-custom-components-in-shiny-for-python">Using Shiny</a>
<ul>
<li><a href="#org2a5ea21">Ways to extend Shiny</a>
<ul>
<li><a href="#org5101769">Including JavaScript directly</a></li>
<li><a href="#orgc640219">One-off custom components</a>
<ul>
<li><a href="#org5f19267">JavaScript output binding</a></li>
<li><a href="#orgeffbfc4">Python server-side code</a></li>
</ul>
</li>
<li><a href="#org41716a1">Custom component packages</a></li>
</ul>
</li>
<li><a href="#techniques-for-wrapping-cytoscapejs-for-shiny-for-python">Using Cytoscape.js</a>
<ul>
<li><a href="#org9686f13">Code</a>
<ul>
<li><a href="#orgcdbc5e8">Ipyleaflet Shiny Express app</a></li>
<li><a href="#org0316e03">Cytoscape utils</a></li>
<li><a href="#org4bf71ef">Cytoscape Shiny Express app with full redraw</a></li>
<li><a href="#app-core-ipycyto-nx-full">Cytoscape Shiny Core app with full redraw</a></li>
<li><a href="#app-core-ipycyto-cyto-full">Cytoscape Shiny Core app with full redraw, no networkx</a></li>
<li><a href="#org42ac3ac">Ipyleaflet Shiny Core app with incremental redraw</a></li>
<li><a href="#org8ddd3da">Cytoscape Shiny Core app with incremental redraw</a></li>
</ul>
</li>
<li><a href="#org4d609a0">Conclusion</a></li>
</ul>
</li>
<li><a href="#orgd837a33">Using ipysigma</a>
<ul>
<li><a href="#org97a055a">Code</a>
<ul>
<li><a href="#org1cfddf4">ipysigma Shiny Core app with full redraw</a></li>
<li><a href="#orga564766">ipysigma Shiny Core node navigator</a></li>
</ul>
</li>
<li><a href="#org31186a9">Conclusion</a></li>
</ul>
</li>
<li><a href="#org27e7009">Using pyvis</a>
<ul>
<li><a href="#org1bd80bf">pyvis Shiny Core node navigator</a></li>
<li><a href="#org9ecb917">Conclusion</a></li>
</ul>
</li>
<li><a href="#org2faada5">D3</a>
<ul>
<li><a href="#org7a062c2">D3 navigator</a></li>
</ul>
</li>
<li><a href="#orgfd941b3">Debugging Shiny</a>
<ul>
<li><a href="#org971cc7d">Websockets logging</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0336711">Utilities</a>
<ul>
<li><a href="#org3aead1c">Generic utilities</a></li>
<li><a href="#orgb695e04">Graph utilities</a></li>
<li><a href="#org0bcf899">Data providers</a>
<ul>
<li><a href="#orga5dc3f8">Shakespeare data</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction">Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Developing browser-based applications for
the exploration and visualization of directed acyclic graphs (DAGs)
is a significant challenge in Python.
The combination of web application frameworks like
Shiny for Python<sup><a id="fnr.shiny-overview" class="footref" href="#fn.shiny-overview" role="doc-backlink">1</a></sup>,
component frameworks like <a href="#jupyter-widgets">Jupyter Widgets</a>, and
graph visualization libraries integrated with these
offer an attractive possible solution.
This report explores using different combinations of packages
to achieve our goals.
</p>
</div>
</div>
<div id="outline-container-org41a6df8" class="outline-2">
<h2 id="org41a6df8">Targets</h2>
<div class="outline-text-2" id="text-org41a6df8">
<p>
We want to create an application that, in rough priority order:
</p>
<ol class="org-ol">
<li>Displays a directed acyclic graph</li>
<li>Supports user interactions driving server-side actions</li>
<li>Supports user interactions driving UI elements mediated by server-side code</li>
<li>Supports the above with incremental redrawing of updated UI elements</li>
</ol>

<p>
Also, our preferred order for architectures is:
</p>
<ol class="org-ol">
<li>Primarily Python and server-side driven, with generated front-end Javascript,
e.g. Shiny for Python, Bokeh or Plotly Dash.</li>
<li>As above but with R rather than Python (i.e. R Shiny).</li>
<li>Primarily front-end driven, with lightweight Javascript or Typescript calling
into a mostly separate back-end API written in Python.  A simple D3 or React
front-end might be a candidate here.</li>
<li>Anything else (e.g. other languages, heavy front-end frameworks).</li>
</ol>
</div>
</div>
<div id="outline-container-org5f18465" class="outline-2">
<h2 id="org5f18465">Supporting packages</h2>
<div class="outline-text-2" id="text-org5f18465">
</div>
<div id="outline-container-jupyter-widgets" class="outline-3">
<h3 id="jupyter-widgets">Jupyter Widgets</h3>
<div class="outline-text-3" id="text-jupyter-widgets">
<p>
Jupyter widgets, also known as ipywidgets, are interactive HTML widgets for Jupyter notebooks.
They allow developers to create GUI-like elements within notebooks.
Widgets let users interact with plots, images, and data tables, modify inputs, and see results in real time.
They include components like sliders, buttons, and text boxes,
which can link to Python functions and data events, allowing dynamic computation and visualization.
</p>

<p>
Application frameworks like Bokeh, Dash, and Shiny for Python support
using Jupyter widgets to add interaction capabilities.
This lets developers build browser-based applications with
the same widget components that are used in Jupyter notebook environments.
</p>
</div>
</div>
<div id="outline-container-cytoscape-js" class="outline-3">
<h3 id="cytoscape-js">Cytoscape.js</h3>
<div class="outline-text-3" id="text-cytoscape-js">
<p>
Cytoscape.js (<a href="https://js.cytoscape.org/">https://js.cytoscape.org/</a>) is an open-source JavaScript library
for visualizing and analyzing network data.
It serves as a building block for
creating interactive network visualizations in web browsers<sup><a id="fnr.cytoscapejs-and-cytoscape" class="footref" href="#fn.cytoscapejs-and-cytoscape" role="doc-backlink">2</a></sup>.
It's optimized, has no external dependencies, and works with most modern browsers.
Features include pan and zoom, node and edge styling, layout algorithms,
and support for graph theory algorithms.
</p>

<p>
Core to Cytoscape.js is the graph instance, initialized with a DOM container,
an array of elements (nodes and edges), styling rules, and a layout algorithm.
It uses a JSON format to represent graph data,
defining nodes and edges as JavaScript objects
with unique identifiers and source-target relationships.
CSS-based styling allows customization of nodes and edges based on data attributes.
The library provides an API for programmatic interaction, including
modifying elements, applying layouts, and managing user interactions.
Numerous examples and demos available online help showcase its capabilities.
</p>
</div>
</div>
<div id="outline-container-shinywidgets" class="outline-3">
<h3 id="shinywidgets">shinywidgets</h3>
<div class="outline-text-3" id="text-shinywidgets">
<p>
The shinywidgets Python package (<a href="https://shiny.posit.co/py/docs/jupyter-widgets.html">https://shiny.posit.co/py/docs/jupyter-widgets.html</a>)
enables the integration of ipywidgets (Jupyter Widgets) into Shiny for Python applications.
It is part of the ipywidgets ecosystem,
in which popular Python packages provide interactive widgets including:
</p>
<ul class="org-ul">
<li>Visualization, with tools like Altair, Bokeh, and Plotly</li>
<li>Mapping, featuring Pydeck and ipyleaflet</li>
<li>Data display, utilizing ipydatagrid and ipysheet</li>
<li>3D rendering, through ipyvolume and pythreejs</li>
<li>Media, with ipywebrtc</li>
</ul>

<p>
This integration allows for
seamless rendering, efficient updates, and responsive user interactions
within Shiny applications using ipywidgets.
</p>
</div>
</div>
