navigator.org
*** ipycytoscape
    :PROPERTIES:
    :CUSTOM_ID: ipycytoscape
    :END:
    ipycytoscape (https://ipycytoscape.readthedocs.io/en/master/)
    is an interactive widget for Jupyter notebooks that
    leverages the Cytoscape.js library
    to provide dynamic graph visualizations.
    Its target users are data scientists and researchers who work with network data,
    as it allows users to create, interact with, and
    customize graphical representations of network structures
    using Jupyter widgets.  It supports interactivity by allowing the user to bind actions to graph events,
    like clicks or node selections.

*** ipysigma
    :PROPERTIES:
    :ID:       56cce4de-511c-4fd9-b783-1019b378de0c
    :END:

    ipysigma is a Jupyter widget built on Sigma.js,
    designed to render interactive network visualizations effortlessly.
    It integrates with popular Python libraries such as networkx and igraph,
    allowing users to map graph structures and metrics into visual formats.
    ipysigma emphasizes customizable visualization features,
    focusing on node and edge properties like color, size, and shape,
    while supporting efficient rendering of large graphs.
    It also offers interactive capabilities,
    such as synchronized views for comparing features within the same graph.

    For further information, you can visit
    - the [[https://github.com/medialab/ipysigma][ipysigma GitHub repository]] and
    - the [[https://pypi.org/project/ipysigma/][PyPI page for ipysigma]].
    - this [[https://archive.fosdem.org/2023/schedule/event/graph_ipysigma/][talk at FOSDEM 2023]]

    ipysigma's main use cases are for exploring graph structure and data
    rather than graph-driven interactivity which may not be a good fit here.
*** Pyvis
    :PROPERTIES:
    :ID:       54b92d04-5cfb-4dfc-9cd5-a663c5654cb8
    :END:
    - *Basis:* Wraps the vis.js JavaScript library.
    - *Features:* Designed to make creating interactive network graphs easy
      with just a few lines of Python code.
      It allows for interactive exploration and physics adjustments directly
      within a Jupyter notebook or exported HTML file.
    - *Links:*
      - https://pyvis.readthedocs.io/en/latest/
      - https://arxiv.org/abs/2006.04951
    - *Note:*
      - Impressive interactivity capabilities,
        including a built-in control panel to control layout parameters.
      - Doesn't have a native option to display using ipywidgets.
        There is a way to display in a Jupyter notebook
        by changing the arguments to the constructor.
      - It is possible to include pyvis components in Shiny directly,
        without using py-shinywidgets,
        as noted in this response to a request for support in py-shinywidgets:
        https://github.com/posit-dev/py-shinywidgets/issues/63.
    - *Conclusion:*
      - Displays graphs using an external HTML file, so rejected.
*** D3
    - *Basis:* Pure JavaScript library
    - *Features:* Provides a highly customizable framework for interactive visualizations.
      Low-level in terms of the graphical primitives it offers,
      but high-level in that it provides supporting tooling and offers
      a way to compose sophisticated visualizations from fairly simple elements.
    - *Note:*
      - Writing "ground-up" visualizations with D3 is actually quite easy,
        even for someone not familiar with Javascript if using an LLM coding assistant.
        The resulting code can be directly embedded in HTML and
        deployed anywhere that will accept fragments of generic HTML documents,
        e.g. Confluence.
      - Using D3 directly would essentially be a two-language approach
        with Javascript on the front end and Python on the back end.
        The front-end Javascript can also be extended to call external services,
        e.g. to get data or to trigger server-side calculations.
        The main session state and focus of the design
        moves partly into the Jaavscript world in this approach.
      - This was an approach I hadn't taken seriously until
        playing around with it in Confluence, and calling out to external data sources.
        Language model support for wiring up the boilerplate to get started with
        was especially helpful.
      - Other UI elements would still have to come from somewhere,
        e.g. 1) Shiny, Dash or similar, 2) a javascript framework like react, or 3)
        something like htmx.
*** d3blocks
    - https://github.com/d3blocks/d3blocks
    - **Basis:* Python library for generating Javascript
    - **Features:* Create stand-alone and interactive d3 charts.
      Supports a range of widely-used chart types.
    - **Notes:*
*** d3graph
    - https://github.com/erdogant/d3graph
    - **Basis:* Python package
    - **Features:* Simplifies creating networks in D3
    - **Notes:*
*** ipydagred3
    :PROPERTIES:
    :ID:       53871af9-39da-435f-a93c-9990a53e6148
    :END:
    - *Basis:* Uses dagre-d3 library.
    - *Features:* Specifically designed for drawing Directed Acyclic Graphs (DAGs) within JupyterLab.
*** ipyelk
    :PROPERTIES:
    :ID:       57228ce0-eb9d-4c0c-b18e-edf18aa4502a
    :END:
    - *Basis:* Uses the Eclipse Layout Kernel (ELK) via elkjs.
    - *Features:* Provides sophisticated layout algorithms, potentially useful for complex diagrams.
      Mentioned as having potential for features like collapsing/expanding subgraphs.
*** Dash
    :PROPERTIES:
    :ID:       bd56bc25-4e8a-447c-bf9f-dcb6323ebc39
    :END:
    - *Basis:* Built on Plotly.js.
    - *Features:* A very versatile library for creating a wide range of interactive plots, including
      network graphs, often using NetworkX data structures as input.
      It offers extensive customization and works seamlessly in Jupyter notebooks and Dash web applications.
      You can create interactive scatter plots for nodes and line plots for edges.
    - *Note:*
      - Search results highlight Plotly frequently for general interactive visualizations in Jupyter.
      - Plotly has dedicated support for cytoscape through [[https://dash.plotly.com/cytoscape/][Dash Cytoscape]].
        The documentation describes how to
        use callbacks triggered by clicks to add and remove nodes.
        This seems to be dong using Dash's own facilities for managing
        inputs, outputs and state
        rather than using the Cytoscape graph.
        Presumably the graph is redrawn each time,
        unless they have a workaround for Cytoscape's bugs.
*** Bokeh
    :PROPERTIES:
    :ID:       f8d763d3-8d7e-490d-9624-eb90f07f64a6
    :END:
    - *Basis:* Bokeh's own JS library.
    - *Features:* Excellent for creating interactive, web-based visualizations, including network graphs.
      Known for high-performance interactivity, handling large datasets,
      and streaming data capabilities. Integrates well with Jupyter.
