navigator.html
<div id="outline-container-ipycytoscape" class="outline-3">
<h3 id="ipycytoscape">ipycytoscape</h3>
<div class="outline-text-3" id="text-ipycytoscape">
<p>
ipycytoscape (<a href="https://ipycytoscape.readthedocs.io/en/master/">https://ipycytoscape.readthedocs.io/en/master/</a>)
is an interactive widget for Jupyter notebooks that
leverages the Cytoscape.js library
to provide dynamic graph visualizations.
Its target users are data scientists and researchers who work with network data,
as it allows users to create, interact with, and
customize graphical representations of network structures
using Jupyter widgets.  It supports interactivity by allowing the user to bind actions to graph events,
like clicks or node selections.
</p>
</div>
</div>
<div id="outline-container-org7e027fa" class="outline-3">
<h3 id="org7e027fa">ipysigma</h3>
<div class="outline-text-3" id="text-org7e027fa">
<p>
ipysigma is a Jupyter widget built on Sigma.js,
designed to render interactive network visualizations effortlessly.
It integrates with popular Python libraries such as networkx and igraph,
allowing users to map graph structures and metrics into visual formats.
ipysigma emphasizes customizable visualization features,
focusing on node and edge properties like color, size, and shape,
while supporting efficient rendering of large graphs.
It also offers interactive capabilities,
such as synchronized views for comparing features within the same graph.
</p>

<p>
For further information, you can visit
</p>
<ul class="org-ul">
<li>the <a href="https://github.com/medialab/ipysigma">ipysigma GitHub repository</a> and</li>
<li>the <a href="https://pypi.org/project/ipysigma/">PyPI page for ipysigma</a>.</li>
<li>this <a href="https://archive.fosdem.org/2023/schedule/event/graph_ipysigma/">talk at FOSDEM 2023</a></li>
</ul>

<p>
ipysigma's main use cases are for exploring graph structure and data
rather than graph-driven interactivity which may not be a good fit here.
</p>
</div>
</div>
<div id="outline-container-org9eeb36e" class="outline-3">
<h3 id="org9eeb36e">Pyvis</h3>
<div class="outline-text-3" id="text-org9eeb36e">
<ul class="org-ul">
<li><b>Basis:</b> Wraps the vis.js JavaScript library.</li>
<li><b>Features:</b> Designed to make creating interactive network graphs easy
with just a few lines of Python code.
It allows for interactive exploration and physics adjustments directly
within a Jupyter notebook or exported HTML file.</li>
<li><b>Links:</b>
<ul class="org-ul">
<li><a href="https://pyvis.readthedocs.io/en/latest/">https://pyvis.readthedocs.io/en/latest/</a></li>
<li><a href="https://arxiv.org/abs/2006.04951">https://arxiv.org/abs/2006.04951</a></li>
</ul></li>
<li><b>Note:</b>
<ul class="org-ul">
<li>Impressive interactivity capabilities,
including a built-in control panel to control layout parameters.</li>
<li>Doesn't have a native option to display using ipywidgets.
There is a way to display in a Jupyter notebook
by changing the arguments to the constructor.</li>
<li>It is possible to include pyvis components in Shiny directly,
without using py-shinywidgets,
as noted in this response to a request for support in py-shinywidgets:
<a href="https://github.com/posit-dev/py-shinywidgets/issues/63">https://github.com/posit-dev/py-shinywidgets/issues/63</a>.</li>
</ul></li>
<li><b>Conclusion:</b>
<ul class="org-ul">
<li>Displays graphs using an external HTML file, so rejected.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge697c5e" class="outline-3">
<h3 id="orge697c5e">D3</h3>
<div class="outline-text-3" id="text-orge697c5e">
<ul class="org-ul">
<li><b>Basis:</b> Pure JavaScript library</li>
<li><b>Features:</b> Provides a highly customizable framework for interactive visualizations.
Low-level in terms of the graphical primitives it offers,
but high-level in that it provides supporting tooling and offers
a way to compose sophisticated visualizations from fairly simple elements.</li>
<li><b>Note:</b>
<ul class="org-ul">
<li>Writing "ground-up" visualizations with D3 is actually quite easy,
even for someone not familiar with Javascript if using an LLM coding assistant.
The resulting code can be directly embedded in HTML and
deployed anywhere that will accept fragments of generic HTML documents,
e.g. Confluence.</li>
<li>Using D3 directly would essentially be a two-language approach
with Javascript on the front end and Python on the back end.
The front-end Javascript can also be extended to call external services,
e.g. to get data or to trigger server-side calculations.
The main session state and focus of the design
moves partly into the Jaavscript world in this approach.</li>
<li>This was an approach I hadn't taken seriously until
playing around with it in Confluence, and calling out to external data sources.
Language model support for wiring up the boilerplate to get started with
was especially helpful.</li>
<li>Other UI elements would still have to come from somewhere,
e.g. 1) Shiny, Dash or similar, 2) a javascript framework like react, or 3)
something like htmx.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org222433b" class="outline-3">
<h3 id="org222433b">d3blocks</h3>
<div class="outline-text-3" id="text-org222433b">
<ul class="org-ul">
<li><a href="https://github.com/d3blocks/d3blocks">https://github.com/d3blocks/d3blocks</a></li>
<li><b>*Basis:</b> Python library for generating Javascript</li>
<li><b>*Features:</b> Create stand-alone and interactive d3 charts.
Supports a range of widely-used chart types.</li>
<li><b>*Notes:</b></li>
</ul>
</div>
</div>
<div id="outline-container-org9bdbafd" class="outline-3">
<h3 id="org9bdbafd">d3graph</h3>
<div class="outline-text-3" id="text-org9bdbafd">
<ul class="org-ul">
<li><a href="https://github.com/erdogant/d3graph">https://github.com/erdogant/d3graph</a></li>
<li><b>*Basis:</b> Python package</li>
<li><b>*Features:</b> Simplifies creating networks in D3</li>
<li><b>*Notes:</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgcfb3aad" class="outline-3">
<h3 id="orgcfb3aad">ipydagred3</h3>
<div class="outline-text-3" id="text-orgcfb3aad">
<ul class="org-ul">
<li><b>Basis:</b> Uses dagre-d3 library.</li>
<li><b>Features:</b> Specifically designed for drawing Directed Acyclic Graphs (DAGs) within JupyterLab.</li>
</ul>
</div>
</div>
<div id="outline-container-orge5bd654" class="outline-3">
<h3 id="orge5bd654">ipyelk</h3>
<div class="outline-text-3" id="text-orge5bd654">
<ul class="org-ul">
<li><b>Basis:</b> Uses the Eclipse Layout Kernel (ELK) via elkjs.</li>
<li><b>Features:</b> Provides sophisticated layout algorithms, potentially useful for complex diagrams.
Mentioned as having potential for features like collapsing/expanding subgraphs.</li>
</ul>
</div>
</div>
<div id="outline-container-org93b88f0" class="outline-3">
<h3 id="org93b88f0">Dash</h3>
<div class="outline-text-3" id="text-org93b88f0">
<ul class="org-ul">
<li><b>Basis:</b> Built on Plotly.js.</li>
<li><b>Features:</b> A very versatile library for creating a wide range of interactive plots, including
network graphs, often using NetworkX data structures as input.
It offers extensive customization and works seamlessly in Jupyter notebooks and Dash web applications.
You can create interactive scatter plots for nodes and line plots for edges.</li>
<li><b>Note:</b>
<ul class="org-ul">
<li>Search results highlight Plotly frequently for general interactive visualizations in Jupyter.</li>
<li>Plotly has dedicated support for cytoscape through <a href="https://dash.plotly.com/cytoscape/">Dash Cytoscape</a>.
The documentation describes how to
use callbacks triggered by clicks to add and remove nodes.
This seems to be dong using Dash's own facilities for managing
inputs, outputs and state
rather than using the Cytoscape graph.
Presumably the graph is redrawn each time,
unless they have a workaround for Cytoscape's bugs.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaedf332" class="outline-3">
<h3 id="orgaedf332">Bokeh</h3>
<div class="outline-text-3" id="text-orgaedf332">
<ul class="org-ul">
<li><b>Basis:</b> Bokeh's own JS library.</li>
<li><b>Features:</b> Excellent for creating interactive, web-based visualizations, including network graphs.
Known for high-performance interactivity, handling large datasets,
and streaming data capabilities. Integrates well with Jupyter.</li>
</ul>
</div>
</div>
