navigator.org
*** Altair
    :PROPERTIES:
    :ID:       65803d29-8325-4b9e-96cd-fb56cab46191
    :END:
    - *Basis:* Built on Vega-Lite, a declarative grammar.
    - *Features:* Focuses on a declarative approach, simplifying the creation
      of complex statistical visualizations.
      Does not directly support network graphs, although
      the [[https://altair-viz.github.io/getting_started/resources.html#nx-altair][nx_altair]] package provides some basic support.
* Using Shiny
  :PROPERTIES:
  :CUSTOM_ID: methods-for-creating-custom-components-in-shiny-for-python
  :ID:       eb0f9b0a-bf2b-4949-996b-eb2d85b06d5e
  :END:

*** Ways to extend Shiny
    Shiny provides several approaches for extending its built-in component library
    with arbitrary JavaScript functionality,
    allowing one to create richer and more interactive user interfaces.
***** Including JavaScript directly
      :PROPERTIES:
      :ID:       2fd24b9e-1547-481a-a78c-b9439099b7b9
      :END:
      Shiny allows including JavaScript files
      directly within an application's static assets directory (typically named www)
      or via functions like =ui.include_js=[fn:shiny-python-js].
      This enables the execution of JavaScript code on the client-side,
      allowing for interaction with the DOM and integration with JavaScript libraries.

      While this method is straightforward for adding simple JavaScript functionality,
      wrapping a complex library like Cytoscape.js
      often benefits from the more structured approaches offered by creating
      either one-off custom components or custom component packages.

***** One-off custom components
      :PROPERTIES:
      :ID:       bb39af16-fa88-43c2-8fe9-7e66c133ff86
      :END:
      One-off custom JavaScript components[fn:shiny-custom-js] are developed for specific applications.

      This allows the integration of specific JavaScript libraries
      without the need to create a full component package.

      To create a one-off custom component, you need to write the following:
      1. A JavaScript output binding that tells Shiny how to render the component in the browser
      2. A Python output function to describe the HTML output element in the user interface.
         This refers to the JavaScript output binding.
      3. A Python render decorator to transfer data from the server to the client.
         This may refer to the Python output function to provide automated output.

      Although not covered here, communication can also occur in the reverse direction,
      from JavaScript to Python,
      by using Shiny's input bindings or custom messages
      - Input bindings allow JavaScript components to send data back to the Shiny server
        when user interactions occur.
      - Custom messages provide a more flexible mechanism for asynchronous communication,
        enabling more complex interactions between JavaScript and Python.
      For guidance on creating input bindings,
      see the "Custom components package" page in the Shiny documentation[fn:shiny-custom-components],
      which describes how to create a custom component for Shiny inputs.

******* JavaScript output binding
        :PROPERTIES:
        :ID:       7026bf8a-694b-49db-8560-8b5630e4647c
        :END:
        The output binding typically includes two key methods:
        =find()= and =renderValue()=.

        Some sample code:
        #+begin_src javascript :tangle no
          class TabulatorOutputBinding extends Shiny.OutputBinding {
              // Find element to render in
              find(scope) { ... }

              // Render output element in the found element
              renderValue(el, payload) { ... }
          }

          // Register the binding
          Shiny.outputBindings.register(
              new TabulatorOutputBinding(),
              "shiny-tabulator-output"
          );
        #+end_src

        The =find()= method is responsible for locating the HTML element in the Shiny application
        where the component will be rendered.
        This is often done by targeting
        a specific CSS class or ID assigned to a div element in the UI.

        The =renderValue()= method contains the core logic
        for initializing and updating the JavaScript display.
        This method receives data from the Python backend, typically in a JSON format,
        and uses it to configure the component's elements, style, and layout.

