navigator.html
<div id="outline-container-org708aade" class="outline-3">
<h3 id="org708aade">Altair</h3>
<div class="outline-text-3" id="text-org708aade">
<ul class="org-ul">
<li><b>Basis:</b> Built on Vega-Lite, a declarative grammar.</li>
<li><b>Features:</b> Focuses on a declarative approach, simplifying the creation
of complex statistical visualizations.
Does not directly support network graphs, although
the <a href="https://altair-viz.github.io/getting_started/resources.html#nx-altair">nx_altair</a> package provides some basic support.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-methods-for-creating-custom-components-in-shiny-for-python" class="outline-2">
<h2 id="methods-for-creating-custom-components-in-shiny-for-python">Using Shiny</h2>
<div class="outline-text-2" id="text-methods-for-creating-custom-components-in-shiny-for-python">
</div>
<div id="outline-container-org2a5ea21" class="outline-3">
<h3 id="org2a5ea21">Ways to extend Shiny</h3>
<div class="outline-text-3" id="text-org2a5ea21">
<p>
Shiny provides several approaches for extending its built-in component library
with arbitrary JavaScript functionality,
allowing one to create richer and more interactive user interfaces.
</p>
</div>
<div id="outline-container-org5101769" class="outline-4">
<h4 id="org5101769">Including JavaScript directly</h4>
<div class="outline-text-4" id="text-org5101769">
<p>
Shiny allows including JavaScript files
directly within an application's static assets directory (typically named www)
or via functions like <code>ui.include_js</code><sup><a id="fnr.shiny-python-js" class="footref" href="#fn.shiny-python-js" role="doc-backlink">3</a></sup>.
This enables the execution of JavaScript code on the client-side,
allowing for interaction with the DOM and integration with JavaScript libraries.
</p>

<p>
While this method is straightforward for adding simple JavaScript functionality,
wrapping a complex library like Cytoscape.js
often benefits from the more structured approaches offered by creating
either one-off custom components or custom component packages.
</p>
</div>
</div>
<div id="outline-container-orgc640219" class="outline-4">
<h4 id="orgc640219">One-off custom components</h4>
<div class="outline-text-4" id="text-orgc640219">
<p>
One-off custom JavaScript components<sup><a id="fnr.shiny-custom-js" class="footref" href="#fn.shiny-custom-js" role="doc-backlink">4</a></sup> are developed for specific applications.
</p>

<p>
This allows the integration of specific JavaScript libraries
without the need to create a full component package.
</p>

<p>
To create a one-off custom component, you need to write the following:
</p>
<ol class="org-ol">
<li>A JavaScript output binding that tells Shiny how to render the component in the browser</li>
<li>A Python output function to describe the HTML output element in the user interface.
This refers to the JavaScript output binding.</li>
<li>A Python render decorator to transfer data from the server to the client.
This may refer to the Python output function to provide automated output.</li>
</ol>

<p>
Although not covered here, communication can also occur in the reverse direction,
from JavaScript to Python,
by using Shiny's input bindings or custom messages
</p>
<ul class="org-ul">
<li>Input bindings allow JavaScript components to send data back to the Shiny server
when user interactions occur.</li>
<li>Custom messages provide a more flexible mechanism for asynchronous communication,
enabling more complex interactions between JavaScript and Python.</li>
</ul>
<p>
For guidance on creating input bindings,
see the "Custom components package" page in the Shiny documentation<sup><a id="fnr.shiny-custom-components" class="footref" href="#fn.shiny-custom-components" role="doc-backlink">5</a></sup>,
which describes how to create a custom component for Shiny inputs.
</p>
</div>
<div id="outline-container-org5f19267" class="outline-5">
<h5 id="org5f19267">JavaScript output binding</h5>
<div class="outline-text-5" id="text-org5f19267">
<p>
The output binding typically includes two key methods:
<code>find()</code> and <code>renderValue()</code>.
</p>

<p>
Some sample code:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span class="org-keyword">class</span> TabulatorOutputBinding <span class="org-keyword">extends</span> Shiny.OutputBinding {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Find element to render in</span>
    find(scope) { ... }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Render output element in the found element</span>
    renderValue(el, payload) { ... }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Register the binding</span>
Shiny.outputBindings.register(
    <span class="org-keyword">new</span> <span class="org-type">TabulatorOutputBinding</span>(),
    <span class="org-string">"shiny-tabulator-output"</span>
);
</pre>
</div>

<p>
The <code>find()</code> method is responsible for locating the HTML element in the Shiny application
where the component will be rendered.
This is often done by targeting
a specific CSS class or ID assigned to a div element in the UI.
</p>

<p>
The <code>renderValue()</code> method contains the core logic
for initializing and updating the JavaScript display.
This method receives data from the Python backend, typically in a JSON format,
and uses it to configure the component's elements, style, and layout.
</p>
</div>
</div>
