navigator.org
******* Python server-side code
        :PROPERTIES:
        :ID:       0abcf43a-58d6-41b5-ba43-9c2cb8c7171c
        :END:

********* Output function
          :PROPERTIES:
          :ID:       3d6783c6-0948-49ec-9406-096a94235e2e
          :END:
          On the Python side, an output function needs to be defined
          to place the designated HTML element in the Shiny application's user interface.

          #+CAPTION: Sample Python Code defining an output_ function
          #+begin_src python :tangle no
            from shiny import App, Inputs, ui
            from shiny.module import resolve_id

            from htmltools import HTMLDependency

            tabulator_dep = HTMLDependency(
                "tabulator",
                "5.5.2",
                source={"subdir": "tabulator"},
                script={"src": "tableComponent.js", "type": "module"},
                stylesheet={"href": "tabulator.min.css"},
                all_files=True,
            )

            def output_tabulator(id, height="200px"):
                return ui.div(
                    tabulator_dep,
                    # Use resolve_id so that our component will work in a module
                    id=resolve_id(id),
                    class_="shiny-tabulator-output",
                    style=f"height: {height}",
                )
          #+end_src

          The =htmltools.HTMLDependency= class is used to ensure
          that the necessary JavaScript and CSS assets and the custom output binding
          are included in the Shiny application.

********* Render decorator
          :PROPERTIES:
          :ID:       c6d100a7-dcfb-4fc0-bcd5-a785910e7d0d
          :END:
          Additionally, a render decorator is needed to
          transform values returned from the functions it decorates into
          data to be passed to the JavaScript =renderValue()= method,
          generally using a JSON-serializable structure.

          #+CAPTION: Sample Python code defining a render decorator
          #+begin_src python :tangle no
            from shiny.render.renderer import Jsonifiable, Renderer

            class render_tabulator(Renderer[pd.DataFrame]):
                """
                Render a pandas dataframe as a tabulator table.
                """

                def auto_output_ui(self):
                    """
                    Express UI for the tabulator renderer
                    """
                    return ui.output_tabulator(self.output_name)

                async def transform(self, value: pd.DataFrame) -> Jsonifiable:
                    """
                    Transform a pandas dataframe into a JSONifiable object that can be
                    passed to the tabulator HTML dependency.
                    """
                    if not isinstance(value, pd.DataFrame):
                        # Throw an error if the value is not a dataframe
                        raise TypeError(f"Expected a pandas.DataFrame, got {type(value)}. ")

                    # Get data from dataframe as a list of lists where each inner list is a
                    # row, column names as array of strings and types of each column as an
                    # array of strings
                    return {
                        "data": value.values.tolist(),
                        "columns": value.columns.tolist(),
                        "type_hints": value.dtypes.astype(str).tolist(),
                    }
          #+end_src

          An implementation of =Renderer= produces a class to be used as a decorator and
          requires at least 3 things:

          1. auto_output_ui (jm: possibly only needed for Shiny Express)
          2. either a transform or render function, and
          3. a value type parameter for the Renderer class.

***** Custom component packages
      :PROPERTIES:
      :ID:       83d13cb5-f60b-4baf-b1f3-bc0e4d2c3bef
      :END:
      A custom component package
      allows reusing integrations across multiple applications.

      The development process involves
      building the front-end component using JavaScript or TypeScript,
      packaging it with necessary metadata and build scripts,
      and then using =shiny-bindings-react= to connect to Shiny's reactivity system.

      For details see the "Custom components package" page in the Shiny documentation[fn:shiny-custom-components].

*** Using Cytoscape.js
    :PROPERTIES:
    :CUSTOM_ID: techniques-for-wrapping-cytoscapejs-for-shiny-for-python
    :ID:       542b9a7f-42f3-4fc5-bd14-59253c4e9f1b
    :END:

    Since Shiny provides the =shinywidgets= package for integrating Jupyter widgets, and
    [[#ipycytoscape][ipycytoscape]] provides a Jupyter widget package for Cytoscape.js,
    the obvious option is to use these together.

    This should allow using Cytoscape.js in Shiny
    without creating a custom JavaScript component, or integrating Cytoscape.js ad hoc.
***** Code
      :PROPERTIES:
      :ID:       29e9c40a-26cb-4c6e-9ee2-3331fd1b9657
      :END:
