navigator.html
<div id="outline-container-orgeffbfc4" class="outline-5">
<h5 id="orgeffbfc4">Python server-side code</h5>
<div class="outline-text-5" id="text-orgeffbfc4">
</div>
<ul class="org-ul">
<li><a id="org3704147"></a>Output function<br />
<div class="outline-text-6" id="text-org3704147">
<p>
On the Python side, an output function needs to be defined
to place the designated HTML element in the Shiny application's user interface.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Sample Python Code defining an output_ function</label><pre class="src src-python"><span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, Inputs, ui
<span class="org-keyword">from</span> shiny.module <span class="org-keyword">import</span> resolve_id

<span class="org-keyword">from</span> htmltools <span class="org-keyword">import</span> HTMLDependency

<span class="org-variable-name">tabulator_dep</span> <span class="org-operator">=</span> HTMLDependency(
    <span class="org-string">"tabulator"</span>,
    <span class="org-string">"5.5.2"</span>,
    source<span class="org-operator">=</span>{<span class="org-string">"subdir"</span>: <span class="org-string">"tabulator"</span>},
    script<span class="org-operator">=</span>{<span class="org-string">"src"</span>: <span class="org-string">"tableComponent.js"</span>, <span class="org-string">"type"</span>: <span class="org-string">"module"</span>},
    stylesheet<span class="org-operator">=</span>{<span class="org-string">"href"</span>: <span class="org-string">"tabulator.min.css"</span>},
    all_files<span class="org-operator">=</span><span class="org-constant">True</span>,
)

<span class="org-keyword">def</span> <span class="org-function-name">output_tabulator</span>(<span class="org-builtin">id</span>, height<span class="org-operator">=</span><span class="org-string">"200px"</span>):
    <span class="org-keyword">return</span> ui.div(
        tabulator_dep,
        <span class="org-comment-delimiter"># </span><span class="org-comment">Use resolve_id so that our component will work in a module</span>
        <span class="org-builtin">id</span><span class="org-operator">=</span>resolve_id(<span class="org-builtin">id</span>),
        class_<span class="org-operator">=</span><span class="org-string">"shiny-tabulator-output"</span>,
        style<span class="org-operator">=</span>f<span class="org-string">"height: </span>{height}<span class="org-string">"</span>,
    )
</pre>
</div>

<p>
The <code>htmltools.HTMLDependency</code> class is used to ensure
that the necessary JavaScript and CSS assets and the custom output binding
are included in the Shiny application.
</p>
</div>
</li>
<li><a id="orgf9fecb7"></a>Render decorator<br />
<div class="outline-text-6" id="text-orgf9fecb7">
<p>
Additionally, a render decorator is needed to
transform values returned from the functions it decorates into
data to be passed to the JavaScript <code>renderValue()</code> method,
generally using a JSON-serializable structure.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Sample Python code defining a render decorator</label><pre class="src src-python"><span class="org-keyword">from</span> shiny.render.renderer <span class="org-keyword">import</span> Jsonifiable, Renderer

<span class="org-keyword">class</span> <span class="org-type">render_tabulator</span>(Renderer[pd.DataFrame]):
    <span class="org-doc">"""</span>
<span class="org-doc">    Render a pandas dataframe as a tabulator table.</span>
<span class="org-doc">    """</span>

    <span class="org-keyword">def</span> <span class="org-function-name">auto_output_ui</span>(<span class="org-keyword">self</span>):
        <span class="org-doc">"""</span>
<span class="org-doc">        Express UI for the tabulator renderer</span>
<span class="org-doc">        """</span>
        <span class="org-keyword">return</span> ui.output_tabulator(<span class="org-keyword">self</span>.output_name)

    <span class="org-keyword">async def</span> <span class="org-function-name">transform</span>(<span class="org-keyword">self</span>, value: pd.DataFrame) <span class="org-operator">-&gt;</span> Jsonifiable:
        <span class="org-doc">"""</span>
<span class="org-doc">        Transform a pandas dataframe into a JSONifiable object that can be</span>
<span class="org-doc">        passed to the tabulator HTML dependency.</span>
<span class="org-doc">        """</span>
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-builtin">isinstance</span>(value, pd.DataFrame):
            <span class="org-comment-delimiter"># </span><span class="org-comment">Throw an error if the value is not a dataframe</span>
            <span class="org-keyword">raise</span> <span class="org-type">TypeError</span>(f<span class="org-string">"Expected a pandas.DataFrame, got </span>{<span class="org-builtin">type</span>(value)}<span class="org-string">. "</span>)

        <span class="org-comment-delimiter"># </span><span class="org-comment">Get data from dataframe as a list of lists where each inner list is a</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">row, column names as array of strings and types of each column as an</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">array of strings</span>
        <span class="org-keyword">return</span> {
            <span class="org-string">"data"</span>: value.values.tolist(),
            <span class="org-string">"columns"</span>: value.columns.tolist(),
            <span class="org-string">"type_hints"</span>: value.dtypes.astype(<span class="org-builtin">str</span>).tolist(),
        }
</pre>
</div>

<p>
An implementation of <code>Renderer</code> produces a class to be used as a decorator and
requires at least 3 things:
</p>

<ol class="org-ol">
<li>auto_output_ui (jm: possibly only needed for Shiny Express)</li>
<li>either a transform or render function, and</li>
<li>a value type parameter for the Renderer class.</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org41716a1" class="outline-4">
<h4 id="org41716a1">Custom component packages</h4>
<div class="outline-text-4" id="text-org41716a1">
<p>
A custom component package
allows reusing integrations across multiple applications.
</p>

<p>
The development process involves
building the front-end component using JavaScript or TypeScript,
packaging it with necessary metadata and build scripts,
and then using <code>shiny-bindings-react</code> to connect to Shiny's reactivity system.
</p>

<p>
For details see the "Custom components package" page in the Shiny documentation<sup><a id="fnr.shiny-custom-components.5" class="footref" href="#fn.shiny-custom-components" role="doc-backlink">5</a></sup>.
</p>
</div>
</div>
</div>
<div id="outline-container-techniques-for-wrapping-cytoscapejs-for-shiny-for-python" class="outline-3">
<h3 id="techniques-for-wrapping-cytoscapejs-for-shiny-for-python">Using Cytoscape.js</h3>
<div class="outline-text-3" id="text-techniques-for-wrapping-cytoscapejs-for-shiny-for-python">
<p>
Since Shiny provides the <code>shinywidgets</code> package for integrating Jupyter widgets, and
<a href="#ipycytoscape">ipycytoscape</a> provides a Jupyter widget package for Cytoscape.js,
the obvious option is to use these together.
</p>

<p>
This should allow using Cytoscape.js in Shiny
without creating a custom JavaScript component, or integrating Cytoscape.js ad hoc.
</p>
</div>
