navigator.org
******* Ipyleaflet Shiny Express app
        :PROPERTIES:
        :ID:       89d6fa58-b65e-47f0-97a5-71691ba8e504
        :END:

        This demonstrates that we can use reactive.effect to update ipywidgets in Shiny.  It's
        taken from https://shiny.posit.co/py/docs/jupyter-widgets.html#efficient-updates

        It can be run with e.g.

        : shiny run --reload --log-level debug src/navigator/leaflet_express.py

        This seems to work well, even though the Javascript component involved,
        a full mapping user interface, is quite complex.

        #+begin_src python :tangle src/navigator/leaflet_express.py
          import ipyleaflet as ipyl
          import shiny
          import shinywidgets as sw
          import shiny.express

          from .utils import trace

          city_centers = {
              "London": (51.5074, 0.1278),
              "Paris": (48.8566, 2.3522),
              "New York": (40.7128, -74.0060),
          }

          shiny.express.ui.input_select("center", "Center", choices=list(city_centers.keys()))


          @sw.render_widget
          def map():
              return ipyl.Map(zoom=4)


          @shiny.reactive.effect
          @trace
          def _():
              map.widget.center = city_centers[shiny.express.input.center()]
        #+end_src

******* Cytoscape utils
        :PROPERTIES:
        :ID:       f0d347cd-d444-4b11-9b41-3c222a3636a7
        :END:

        Some utilities for making graphs using ipycytoscape.

        #+begin_src python :tangle src/navigator/cyto_utils.py
          from ipycytoscape import Graph, Node, Edge
          import networkx as nx


          def _node_id(obj, prefix: str) -> str:
              """Return a string node id for the given object"""
              return prefix + str(obj)


          def cyto_node(obj, prefix: str = "") -> Node:
              """Return a Node for the given object and prefix.  prefix is used in setting the node
              ids.
              """
              return Node(data={"id": _node_id(obj, prefix)})


          def cyto_edge(source, target, prefix: str = "") -> Edge:
              """Return an Edge for the given source and target.  prefix is used in setting node ides."""
              return Edge(
                  data={"source": _node_id(source, prefix), "target": _node_id(target, prefix)}
              )


          def make_complete_cyto(num_nodes: int) -> Graph:
              """Return a complete graph with the given number of nodes."""
              nx_complete_graph = nx.complete_graph(num_nodes)
              cyto_complete_graph = Graph()
              prefix = "jmcc"

              cyto_complete_graph.add_nodes(
                  [cyto_node(nx_node, prefix) for nx_node in nx_complete_graph.nodes()]
              )

              cyto_complete_graph.add_edges(
                  [cyto_edge(u, v, prefix) for u, v in nx_complete_graph.edges()]
              )

              return cyto_complete_graph


          def cyto_node_ids(g: Graph) -> list[str]:
              """Return a list of node ids for the graph."""
              return [n.data["id"] for n in g.nodes]
        #+end_src

******* Cytoscape Shiny Express app with full redraw
        :PROPERTIES:
        :ID:       ff8caa81-bf32-4d57-83ec-0c56f3787016
        :END:

        This is a Shiny Express App that displays an ipycytoscape Graph, with number of nodes
        driven by a reactive input.

        This partially works:
        - It displays the initial cytoscape graph for up to c. 20 nodes
        - It responds to events like mouseover on nodes

        However it has major bugs:
        - With more nodes, e.g. 30 it fails, with an error
          : Cannot read properties of undefined (reading 'on_some_change')
        - Even with only a few nodes, updating the input frequently fails with an error
          : Cannot read properties of undefined (reading 'on_some_change')
        - These errors appear to be more common with =--log-level=debug=.

        It can be run with
        : shiny run --reload --log-level debug src/navigator/cyto_express_full.py

        #+begin_src python :tangle src/navigator/cyto_express_full.py
          import os

          import shiny.express
          import shinywidgets as sw

          import networkx as nx
          from ipycytoscape import CytoscapeWidget

          from navigator.utils import log_clicks, log_mouseovers, trace

          INITIAL_NUM_NODES = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))

          # For Shiny Express the UI elements are inferred from inline ui and render expressions.
          # These cannot be made into assignment statements
          shiny.express.ui.h2("Cytoscape Graph (Express API)")
          shiny.express.ui.input_numeric("num_nodes", "Number of nodes:", INITIAL_NUM_NODES, min=1)

          @sw.render_widget
          @trace
          def graph():
              num_nodes = shiny.express.input.num_nodes()
              widget = CytoscapeWidget()
              widget.on("node", "mouseover", log_mouseovers)
              widget.on("node", "click", log_clicks)
              widget.graph.add_graph_from_networkx(nx.complete_graph(num_nodes))
              return widget
        #+end_src

