navigator.html
<div id="outline-container-org9686f13" class="outline-4">
<h4 id="org9686f13">Code</h4>
<div class="outline-text-4" id="text-org9686f13">
</div>
<div id="outline-container-orgcdbc5e8" class="outline-5">
<h5 id="orgcdbc5e8">Ipyleaflet Shiny Express app</h5>
<div class="outline-text-5" id="text-orgcdbc5e8">
<p>
This demonstrates that we can use reactive.effect to update ipywidgets in Shiny.  It's
taken from <a href="https://shiny.posit.co/py/docs/jupyter-widgets.html#efficient-updates">https://shiny.posit.co/py/docs/jupyter-widgets.html#efficient-updates</a>
</p>

<p>
It can be run with e.g.
</p>

<pre class="example">
shiny run --reload --log-level debug src/navigator/leaflet_express.py
</pre>


<p>
This seems to work well, even though the Javascript component involved,
a full mapping user interface, is quite complex.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> ipyleaflet <span class="org-keyword">as</span> ipyl
<span class="org-keyword">import</span> shiny
<span class="org-keyword">import</span> shinywidgets <span class="org-keyword">as</span> sw
<span class="org-keyword">import</span> shiny.express

<span class="org-keyword">from</span> .utils <span class="org-keyword">import</span> trace

<span class="org-variable-name">city_centers</span> <span class="org-operator">=</span> {
    <span class="org-string">"London"</span>: (51.5074, 0.1278),
    <span class="org-string">"Paris"</span>: (48.8566, 2.3522),
    <span class="org-string">"New York"</span>: (40.7128, <span class="org-operator">-</span>74.0060),
}

shiny.express.ui.input_select(<span class="org-string">"center"</span>, <span class="org-string">"Center"</span>, choices<span class="org-operator">=</span><span class="org-builtin">list</span>(city_centers.keys()))


<span class="org-type">@sw.render_widget</span>
<span class="org-keyword">def</span> <span class="org-function-name">map</span>():
    <span class="org-keyword">return</span> ipyl.Map(zoom<span class="org-operator">=</span>4)


<span class="org-type">@shiny.reactive.effect</span>
<span class="org-type">@trace</span>
<span class="org-keyword">def</span> <span class="org-function-name">_</span>():
    <span class="org-builtin">map</span>.widget.<span class="org-variable-name">center</span> <span class="org-operator">=</span> city_centers[shiny.express.<span class="org-builtin">input</span>.center()]
</pre>
</div>
</div>
</div>
<div id="outline-container-org0316e03" class="outline-5">
<h5 id="org0316e03">Cytoscape utils</h5>
<div class="outline-text-5" id="text-org0316e03">
<p>
Some utilities for making graphs using ipycytoscape.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> ipycytoscape <span class="org-keyword">import</span> Graph, Node, Edge
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx


<span class="org-keyword">def</span> <span class="org-function-name">_node_id</span>(obj, prefix: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Return a string node id for the given object"""</span>
    <span class="org-keyword">return</span> prefix <span class="org-operator">+</span> <span class="org-builtin">str</span>(obj)


<span class="org-keyword">def</span> <span class="org-function-name">cyto_node</span>(obj, prefix: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">""</span>) <span class="org-operator">-&gt;</span> Node:
    <span class="org-doc">"""Return a Node for the given object and prefix.  prefix is used in setting the node</span>
<span class="org-doc">    ids.</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">return</span> Node(data<span class="org-operator">=</span>{<span class="org-string">"id"</span>: _node_id(obj, prefix)})


<span class="org-keyword">def</span> <span class="org-function-name">cyto_edge</span>(source, target, prefix: <span class="org-builtin">str</span> <span class="org-operator">=</span> <span class="org-string">""</span>) <span class="org-operator">-&gt;</span> Edge:
    <span class="org-doc">"""Return an Edge for the given source and target.  prefix is used in setting node ides."""</span>
    <span class="org-keyword">return</span> Edge(
        data<span class="org-operator">=</span>{<span class="org-string">"source"</span>: _node_id(source, prefix), <span class="org-string">"target"</span>: _node_id(target, prefix)}
    )


<span class="org-keyword">def</span> <span class="org-function-name">make_complete_cyto</span>(num_nodes: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> Graph:
    <span class="org-doc">"""Return a complete graph with the given number of nodes."""</span>
    <span class="org-variable-name">nx_complete_graph</span> <span class="org-operator">=</span> nx.complete_graph(num_nodes)
    <span class="org-variable-name">cyto_complete_graph</span> <span class="org-operator">=</span> Graph()
    <span class="org-variable-name">prefix</span> <span class="org-operator">=</span> <span class="org-string">"jmcc"</span>

    cyto_complete_graph.add_nodes(
        [cyto_node(nx_node, prefix) <span class="org-keyword">for</span> nx_node <span class="org-keyword">in</span> nx_complete_graph.nodes()]
    )

    cyto_complete_graph.add_edges(
        [cyto_edge(u, v, prefix) <span class="org-keyword">for</span> u, v <span class="org-keyword">in</span> nx_complete_graph.edges()]
    )

    <span class="org-keyword">return</span> cyto_complete_graph


<span class="org-keyword">def</span> <span class="org-function-name">cyto_node_ids</span>(g: Graph) <span class="org-operator">-&gt;</span> <span class="org-builtin">list</span>[<span class="org-builtin">str</span>]:
    <span class="org-doc">"""Return a list of node ids for the graph."""</span>
    <span class="org-keyword">return</span> [n.data[<span class="org-string">"id"</span>] <span class="org-keyword">for</span> n <span class="org-keyword">in</span> g.nodes]
</pre>
</div>
</div>
</div>
<div id="outline-container-org4bf71ef" class="outline-5">
<h5 id="org4bf71ef">Cytoscape Shiny Express app with full redraw</h5>
<div class="outline-text-5" id="text-org4bf71ef">
<p>
This is a Shiny Express App that displays an ipycytoscape Graph, with number of nodes
driven by a reactive input.
</p>

<p>
This partially works:
</p>
<ul class="org-ul">
<li>It displays the initial cytoscape graph for up to c. 20 nodes</li>
<li>It responds to events like mouseover on nodes</li>
</ul>

<p>
However it has major bugs:
</p>
<ul class="org-ul">
<li><p>
With more nodes, e.g. 30 it fails, with an error
</p>
<pre class="example">
Cannot read properties of undefined (reading 'on_some_change')
</pre></li>
<li><p>
Even with only a few nodes, updating the input frequently fails with an error
</p>
<pre class="example">
Cannot read properties of undefined (reading 'on_some_change')
</pre></li>
<li>These errors appear to be more common with <code>--log-level=debug</code>.</li>
</ul>

<p>
It can be run with
</p>
<pre class="example">
shiny run --reload --log-level debug src/navigator/cyto_express_full.py
</pre>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os

<span class="org-keyword">import</span> shiny.express
<span class="org-keyword">import</span> shinywidgets <span class="org-keyword">as</span> sw

<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> ipycytoscape <span class="org-keyword">import</span> CytoscapeWidget

<span class="org-keyword">from</span> navigator.utils <span class="org-keyword">import</span> log_clicks, log_mouseovers, trace

<span class="org-variable-name">INITIAL_NUM_NODES</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))

<span class="org-comment-delimiter"># </span><span class="org-comment">For Shiny Express the UI elements are inferred from inline ui and render expressions.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">These cannot be made into assignment statements</span>
shiny.express.ui.h2(<span class="org-string">"Cytoscape Graph (Express API)"</span>)
shiny.express.ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>1)

<span class="org-type">@sw.render_widget</span>
<span class="org-type">@trace</span>
<span class="org-keyword">def</span> <span class="org-function-name">graph</span>():
    <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> shiny.express.<span class="org-builtin">input</span>.num_nodes()
    <span class="org-variable-name">widget</span> <span class="org-operator">=</span> CytoscapeWidget()
    widget.on(<span class="org-string">"node"</span>, <span class="org-string">"mouseover"</span>, log_mouseovers)
    widget.on(<span class="org-string">"node"</span>, <span class="org-string">"click"</span>, log_clicks)
    widget.graph.add_graph_from_networkx(nx.complete_graph(num_nodes))
    <span class="org-keyword">return</span> widget
</pre>
</div>
</div>
</div>
