navigator.org
******* Cytoscape Shiny Core app with full redraw
        :PROPERTIES:
        :CUSTOM_ID: app-core-ipycyto-nx-full
        :END:

        This is a Shiny Core App that displays an ipycytoscape Graph, with number of nodes
        driven by a reactive input.

        It has similar issues to the corresponding Shiny Express app.

        It can be run with
        : shiny run --reload --log-level debug src/navigator/cyto_core_full.py

        #+begin_src python :tangle src/navigator/cyto_core_full.py
          import os

          from shiny import App, ui, Session
          import shinywidgets as sw

          import networkx as nx
          from ipycytoscape import CytoscapeWidget

          from navigator.utils import log_clicks, log_mouseovers, trace

          INITIAL_NUM_NODES = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))

          # For Shiny Core the UI elements are defined explicitly in a page container
          app_ui = ui.page_fluid(
              ui.h2("Cytoscape Graph (Core API)"),
              ui.input_numeric("num_nodes", "Number of nodes:", value=INITIAL_NUM_NODES, min=1),
              sw.output_widget("graph_output"),
          )

          def server(input, output, session: Session):
              # Note: @sw.render_widget handles the @render.display/@output automatically
              # when the function name matches the output_widget ID.
              @sw.render_widget
              @trace
              def graph_output():
                  num_nodes = input.num_nodes()
                  widget = CytoscapeWidget()
                  widget.on("node", "mouseover", log_mouseovers)
                  widget.on("node", "click", log_clicks)
                  widget.graph.add_graph_from_networkx(nx.complete_graph(num_nodes))
                  return widget

          app = App(app_ui, server)
        #+end_src

******* Cytoscape Shiny Core app with full redraw, no networkx
        :PROPERTIES:
        :CUSTOM_ID: app-core-ipycyto-cyto-full
        :ID:       e98158de-1fcf-48d0-af19-2ffe6764bcff
        :END:

        This is a Shiny Core App that displays an ipycytoscape Graph, with number of nodes
        driven by a reactive input.  The Cytoscape graph is constructed explicitly rather than
        using ipycytoscape's =add_graph_from= methods.

        It has similar issues to the [[#app-core-ipycyto-nx-full][corresponding Shiny Core app using networkx]], but less
        severe in that it works properly with more nodes in the graph; changing the number of
        nodes in the graph generally works when <= 7.

        It can be run with
        : shiny run --reload --log-level debug src/navigator/cyto_core_full2.py

        #+begin_src python :tangle src/navigator/cyto_core_full2.py
          import os

          from shiny import App, ui, Session
          import shinywidgets as sw

          from ipycytoscape import CytoscapeWidget

          from navigator.cyto_utils import make_complete_cyto
          from navigator.utils import log_clicks, log_mouseovers, trace

          INITIAL_NUM_NODES = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))

          # For Shiny Core the UI elements are defined explicitly in a page container
          app_ui = ui.page_fluid(
              ui.h2("Cytoscape Graph (Core API, Cytoscape graph)"),
              ui.input_numeric("num_nodes", "Number of nodes:", value=INITIAL_NUM_NODES, min=1),
              sw.output_widget("graph_output"),
          )

          def server(input, output, session: Session):
              # Note: @sw.render_widget handles the @render.display/@output automatically
              # when the function name matches the output_widget ID.
              @sw.render_widget
              @trace
              def graph_output():
                  num_nodes = input.num_nodes()
                  widget = CytoscapeWidget(graph = make_complete_cyto(num_nodes=num_nodes))
                  widget.on("node", "mouseover", log_mouseovers)
                  widget.on("node", "click", log_clicks)
                  return widget

          app = App(app_ui, server)
        #+end_src

******* Ipyleaflet Shiny Core app with incremental redraw
        The approach here is based on
        the Brownian motion example in the Shiny for Python repo
        at https://github.com/posit-dev/py-shiny/tree/main/examples/brownian

        Each call of the server function leads to creating exactly one widget,
        which is then registered explicitly.
        Subsequent events trigger reactive updates, which mutate the widget.

        : shiny run --reload --log-level debug src/navigator/leaflet_core.py
        #+begin_src python :tangle src/navigator/leaflet_core.py
          import ipyleaflet
          import shiny
          import shinywidgets

          city_centers = {
              "London": (51.5074, 0.1278),
              "Paris": (48.8566, 2.3522),
              "New York": (40.7128, -74.0060),
          }
          map_id = "three_cities"

          app_ui = shiny.ui.page_fixed(
              shiny.ui.h2("Ipyleaflet widget, Shiny Core, incremental redraw"),
              shiny.ui.input_select("center", "Center", choices=list(city_centers)),
              shinywidgets.output_widget(map_id)
              )

          def server(input, _output, _session):
              widget = ipyleaflet.Map(zoom=4)
              shinywidgets.register_widget(map_id, widget)

              @shiny.reactive.effect
              def _():
                  widget.center = city_centers[input.center()]  # pyright: ignore[reportOptionalMemberAccess]

          app = shiny.App(app_ui, server)
        #+end_src
