navigator.html
<div id="outline-container-app-core-ipycyto-nx-full" class="outline-5">
<h5 id="app-core-ipycyto-nx-full">Cytoscape Shiny Core app with full redraw</h5>
<div class="outline-text-5" id="text-app-core-ipycyto-nx-full">
<p>
This is a Shiny Core App that displays an ipycytoscape Graph, with number of nodes
driven by a reactive input.
</p>

<p>
It has similar issues to the corresponding Shiny Express app.
</p>

<p>
It can be run with
</p>
<pre class="example">
shiny run --reload --log-level debug src/navigator/cyto_core_full.py
</pre>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os

<span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, ui, Session
<span class="org-keyword">import</span> shinywidgets <span class="org-keyword">as</span> sw

<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> ipycytoscape <span class="org-keyword">import</span> CytoscapeWidget

<span class="org-keyword">from</span> navigator.utils <span class="org-keyword">import</span> log_clicks, log_mouseovers, trace

<span class="org-variable-name">INITIAL_NUM_NODES</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))

<span class="org-comment-delimiter"># </span><span class="org-comment">For Shiny Core the UI elements are defined explicitly in a page container</span>
<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> ui.page_fluid(
    ui.h2(<span class="org-string">"Cytoscape Graph (Core API)"</span>),
    ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, value<span class="org-operator">=</span>INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>1),
    sw.output_widget(<span class="org-string">"graph_output"</span>),
)

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, output, session: Session):
    <span class="org-comment-delimiter"># </span><span class="org-comment">Note: @sw.render_widget handles the @render.display/@output automatically</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">when the function name matches the output_widget ID.</span>
    <span class="org-type">@sw.render_widget</span>
    <span class="org-type">@trace</span>
    <span class="org-keyword">def</span> <span class="org-function-name">graph_output</span>():
        <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>.num_nodes()
        <span class="org-variable-name">widget</span> <span class="org-operator">=</span> CytoscapeWidget()
        widget.on(<span class="org-string">"node"</span>, <span class="org-string">"mouseover"</span>, log_mouseovers)
        widget.on(<span class="org-string">"node"</span>, <span class="org-string">"click"</span>, log_clicks)
        widget.graph.add_graph_from_networkx(nx.complete_graph(num_nodes))
        <span class="org-keyword">return</span> widget

<span class="org-variable-name">app</span> <span class="org-operator">=</span> App(app_ui, server)
</pre>
</div>
</div>
</div>
<div id="outline-container-app-core-ipycyto-cyto-full" class="outline-5">
<h5 id="app-core-ipycyto-cyto-full">Cytoscape Shiny Core app with full redraw, no networkx</h5>
<div class="outline-text-5" id="text-app-core-ipycyto-cyto-full">
<p>
This is a Shiny Core App that displays an ipycytoscape Graph, with number of nodes
driven by a reactive input.  The Cytoscape graph is constructed explicitly rather than
using ipycytoscape's <code>add_graph_from</code> methods.
</p>

<p>
It has similar issues to the <a href="#app-core-ipycyto-nx-full">corresponding Shiny Core app using networkx</a>, but less
severe in that it works properly with more nodes in the graph; changing the number of
nodes in the graph generally works when &lt;= 7.
</p>

<p>
It can be run with
</p>
<pre class="example">
shiny run --reload --log-level debug src/navigator/cyto_core_full2.py
</pre>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os

<span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, ui, Session
<span class="org-keyword">import</span> shinywidgets <span class="org-keyword">as</span> sw

<span class="org-keyword">from</span> ipycytoscape <span class="org-keyword">import</span> CytoscapeWidget

<span class="org-keyword">from</span> navigator.cyto_utils <span class="org-keyword">import</span> make_complete_cyto
<span class="org-keyword">from</span> navigator.utils <span class="org-keyword">import</span> log_clicks, log_mouseovers, trace

<span class="org-variable-name">INITIAL_NUM_NODES</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))

<span class="org-comment-delimiter"># </span><span class="org-comment">For Shiny Core the UI elements are defined explicitly in a page container</span>
<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> ui.page_fluid(
    ui.h2(<span class="org-string">"Cytoscape Graph (Core API, Cytoscape graph)"</span>),
    ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, value<span class="org-operator">=</span>INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>1),
    sw.output_widget(<span class="org-string">"graph_output"</span>),
)

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, output, session: Session):
    <span class="org-comment-delimiter"># </span><span class="org-comment">Note: @sw.render_widget handles the @render.display/@output automatically</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">when the function name matches the output_widget ID.</span>
    <span class="org-type">@sw.render_widget</span>
    <span class="org-type">@trace</span>
    <span class="org-keyword">def</span> <span class="org-function-name">graph_output</span>():
        <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>.num_nodes()
        <span class="org-variable-name">widget</span> <span class="org-operator">=</span> CytoscapeWidget(graph <span class="org-operator">=</span> make_complete_cyto(num_nodes<span class="org-operator">=</span>num_nodes))
        widget.on(<span class="org-string">"node"</span>, <span class="org-string">"mouseover"</span>, log_mouseovers)
        widget.on(<span class="org-string">"node"</span>, <span class="org-string">"click"</span>, log_clicks)
        <span class="org-keyword">return</span> widget

<span class="org-variable-name">app</span> <span class="org-operator">=</span> App(app_ui, server)
</pre>
</div>
</div>
</div>
<div id="outline-container-org42ac3ac" class="outline-5">
<h5 id="org42ac3ac">Ipyleaflet Shiny Core app with incremental redraw</h5>
<div class="outline-text-5" id="text-org42ac3ac">
<p>
The approach here is based on
the Brownian motion example in the Shiny for Python repo
at <a href="https://github.com/posit-dev/py-shiny/tree/main/examples/brownian">https://github.com/posit-dev/py-shiny/tree/main/examples/brownian</a>
</p>

<p>
Each call of the server function leads to creating exactly one widget,
which is then registered explicitly.
Subsequent events trigger reactive updates, which mutate the widget.
</p>

<pre class="example">
shiny run --reload --log-level debug src/navigator/leaflet_core.py
</pre>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> ipyleaflet
<span class="org-keyword">import</span> shiny
<span class="org-keyword">import</span> shinywidgets

<span class="org-variable-name">city_centers</span> <span class="org-operator">=</span> {
    <span class="org-string">"London"</span>: (51.5074, 0.1278),
    <span class="org-string">"Paris"</span>: (48.8566, 2.3522),
    <span class="org-string">"New York"</span>: (40.7128, <span class="org-operator">-</span>74.0060),
}
<span class="org-variable-name">map_id</span> <span class="org-operator">=</span> <span class="org-string">"three_cities"</span>

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> shiny.ui.page_fixed(
    shiny.ui.h2(<span class="org-string">"Ipyleaflet widget, Shiny Core, incremental redraw"</span>),
    shiny.ui.input_select(<span class="org-string">"center"</span>, <span class="org-string">"Center"</span>, choices<span class="org-operator">=</span><span class="org-builtin">list</span>(city_centers)),
    shinywidgets.output_widget(map_id)
    )

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, _output, _session):
    <span class="org-variable-name">widget</span> <span class="org-operator">=</span> ipyleaflet.Map(zoom<span class="org-operator">=</span>4)
    shinywidgets.register_widget(map_id, widget)

    <span class="org-type">@shiny.reactive.effect</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_</span>():
        widget.<span class="org-variable-name">center</span> <span class="org-operator">=</span> city_centers[<span class="org-builtin">input</span>.center()]  <span class="org-comment-delimiter"># </span><span class="org-comment">pyright: ignore[reportOptionalMemberAccess]</span>

<span class="org-variable-name">app</span> <span class="org-operator">=</span> shiny.App(app_ui, server)
</pre>
</div>
</div>
</div>
