navigator.org
******* Cytoscape Shiny Core app with incremental redraw
        :PROPERTIES:
        :ID:       d2a54f51-3bfd-46d4-9b43-4de9ae178793
        :END:

        #+begin_src python :tangle src/navigator/cyto_core_incremental.py
          import os

          import networkx as nx
          import shiny
          import shinywidgets
          from ipycytoscape import CytoscapeWidget

          from navigator.cyto_utils import make_complete_cyto

          INITIAL_NUM_NODES = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 1))

          graph_id = "graph_output"

          app_ui = shiny.ui.page_fluid(
              shiny.ui.h2("Cytoscape Graph (Core API, Cytoscape graph)"),
              shiny.ui.input_numeric("num_nodes", "Number of nodes:", value=INITIAL_NUM_NODES, min=0),
              shinywidgets.output_widget(graph_id),
          )

          app_ui = shiny.ui.page_fluid(
              shiny.ui.h2("Cytoscape Graph (Core API, Cytoscape graph)"),
              shiny.ui.input_numeric("num_nodes", "Number of nodes:", value=INITIAL_NUM_NODES, min=0),
              shinywidgets.output_widget(graph_id),
          )

          def server(input, _output, _session: shiny.Session):
              widget = CytoscapeWidget(graph = make_complete_cyto(num_nodes=INITIAL_NUM_NODES))
              shinywidgets.register_widget(graph_id, widget)

              @shiny.reactive.effect
              def _():
                  num_nodes = input.num_nodes()
                  print(f"updating for reactive effect {num_nodes=}")
                  g = widget.graph
                  g.clear()
                  g.add_graph_from_networkx(nx.complete_graph(num_nodes))
                  print("finished updating")
          def server(input, _output, _session: shiny.Session):
              widget = CytoscapeWidget(graph = make_complete_cyto(num_nodes=INITIAL_NUM_NODES))
              shinywidgets.register_widget(graph_id, widget)

              @shiny.reactive.effect
              def _():
                  num_nodes = input.num_nodes()
                  print(f"updating for reactive effect {num_nodes=}")
                  g = widget.graph
                  g.clear()
                  g.add_graph_from_networkx(nx.complete_graph(num_nodes))
                  print("finished updating")

          app = shiny.App(app_ui, server)

          def main():
              pass

          if __name__ == '__main__':
              main()
        #+end_src
***** Conclusion
      ipyctoscape is not a viable candidate to work from.

      Although it has an attractive feature set,
      it is not nearly reliable enough to be productive to work with.

      At first I thought this might be due to
      using the package in Shiny rather than in Jupyter but
      there are basic problems in that too,
      e.g. see https://github.com/cytoscape/ipycytoscape/issues/322.

      The functionality for manipulating graphs
      after they have been displayed is completely broken and
      has clearly never been tested on even basic uses cases like the one in issue 322.

*** Using ipysigma
***** Code
******* ipysigma Shiny Core app with full redraw

        This is a Shiny Core App that displays an ipysigma Graph, with number of nodes
        driven by a reactive input.

        It can be run with
        #+begin_src bash
          shiny run --reload --log-level debug src/navigator/ipysigma_core_full.py
        #+end_src

        #+begin_src python :tangle src/navigator/ipysigma_core_full.py
          import os

          import shinywidgets as sw
          import networkx as nx
          from ipysigma import Sigma
          from shiny import App, ui, Session

          from navigator.utils import trace

          INITIAL_NUM_NODES = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))

          app_ui = ui.page_fluid(
              ui.h2("Ipysigma Graph (Core API), full redraw"),
              ui.input_numeric("num_nodes", "Number of nodes:", value=INITIAL_NUM_NODES, min=1),
              sw.output_widget("graph_output"),
          )

          def server(input, _output, _session: Session):
              # pyright: ignore[reportUnusedFunction=false]
              @sw.render_widget
              @trace
              def graph_output():
                  num_nodes = input.num_nodes()
                  nx_graph = nx.complete_graph(num_nodes)

                  widget = Sigma(nx_graph)
                  return widget

          app = App(app_ui, server)
        #+end_src

