navigator.html
<div id="outline-container-org8ddd3da" class="outline-5">
<h5 id="org8ddd3da">Cytoscape Shiny Core app with incremental redraw</h5>
<div class="outline-text-5" id="text-org8ddd3da">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os

<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">import</span> shiny
<span class="org-keyword">import</span> shinywidgets
<span class="org-keyword">from</span> ipycytoscape <span class="org-keyword">import</span> CytoscapeWidget

<span class="org-keyword">from</span> navigator.cyto_utils <span class="org-keyword">import</span> make_complete_cyto

<span class="org-variable-name">INITIAL_NUM_NODES</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 1))

<span class="org-variable-name">graph_id</span> <span class="org-operator">=</span> <span class="org-string">"graph_output"</span>

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> shiny.ui.page_fluid(
    shiny.ui.h2(<span class="org-string">"Cytoscape Graph (Core API, Cytoscape graph)"</span>),
    shiny.ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, value<span class="org-operator">=</span>INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>0),
    shinywidgets.output_widget(graph_id),
)

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> shiny.ui.page_fluid(
    shiny.ui.h2(<span class="org-string">"Cytoscape Graph (Core API, Cytoscape graph)"</span>),
    shiny.ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, value<span class="org-operator">=</span>INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>0),
    shinywidgets.output_widget(graph_id),
)

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, _output, _session: shiny.Session):
    <span class="org-variable-name">widget</span> <span class="org-operator">=</span> CytoscapeWidget(graph <span class="org-operator">=</span> make_complete_cyto(num_nodes<span class="org-operator">=</span>INITIAL_NUM_NODES))
    shinywidgets.register_widget(graph_id, widget)

    <span class="org-type">@shiny.reactive.effect</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_</span>():
        <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>.num_nodes()
        <span class="org-builtin">print</span>(f<span class="org-string">"updating for reactive effect </span>{num_nodes<span class="org-operator">=</span>}<span class="org-string">"</span>)
        <span class="org-variable-name">g</span> <span class="org-operator">=</span> widget.graph
        g.clear()
        g.add_graph_from_networkx(nx.complete_graph(num_nodes))
        <span class="org-builtin">print</span>(<span class="org-string">"finished updating"</span>)
<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, _output, _session: shiny.Session):
    <span class="org-variable-name">widget</span> <span class="org-operator">=</span> CytoscapeWidget(graph <span class="org-operator">=</span> make_complete_cyto(num_nodes<span class="org-operator">=</span>INITIAL_NUM_NODES))
    shinywidgets.register_widget(graph_id, widget)

    <span class="org-type">@shiny.reactive.effect</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_</span>():
        <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>.num_nodes()
        <span class="org-builtin">print</span>(f<span class="org-string">"updating for reactive effect </span>{num_nodes<span class="org-operator">=</span>}<span class="org-string">"</span>)
        <span class="org-variable-name">g</span> <span class="org-operator">=</span> widget.graph
        g.clear()
        g.add_graph_from_networkx(nx.complete_graph(num_nodes))
        <span class="org-builtin">print</span>(<span class="org-string">"finished updating"</span>)

<span class="org-variable-name">app</span> <span class="org-operator">=</span> shiny.App(app_ui, server)

<span class="org-keyword">def</span> <span class="org-function-name">main</span>():
    <span class="org-keyword">pass</span>

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">'__main__'</span>:
    main()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d609a0" class="outline-4">
<h4 id="org4d609a0">Conclusion</h4>
<div class="outline-text-4" id="text-org4d609a0">
<p>
ipyctoscape is not a viable candidate to work from.
</p>

<p>
Although it has an attractive feature set,
it is not nearly reliable enough to be productive to work with.
</p>

<p>
At first I thought this might be due to
using the package in Shiny rather than in Jupyter but
there are basic problems in that too,
e.g. see <a href="https://github.com/cytoscape/ipycytoscape/issues/322">https://github.com/cytoscape/ipycytoscape/issues/322</a>.
</p>

<p>
The functionality for manipulating graphs
after they have been displayed is completely broken and
has clearly never been tested on even basic uses cases like the one in issue 322.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd837a33" class="outline-3">
<h3 id="orgd837a33">Using ipysigma</h3>
<div class="outline-text-3" id="text-orgd837a33">
</div>
<div id="outline-container-org97a055a" class="outline-4">
<h4 id="org97a055a">Code</h4>
<div class="outline-text-4" id="text-org97a055a">
</div>
<div id="outline-container-org1cfddf4" class="outline-5">
<h5 id="org1cfddf4">ipysigma Shiny Core app with full redraw</h5>
<div class="outline-text-5" id="text-org1cfddf4">
<p>
This is a Shiny Core App that displays an ipysigma Graph, with number of nodes
driven by a reactive input.
</p>

<p>
It can be run with
</p>
<div class="org-src-container">
<pre class="src src-bash">shiny run --reload --log-level debug src/navigator/ipysigma_core_full.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os

<span class="org-keyword">import</span> shinywidgets <span class="org-keyword">as</span> sw
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> ipysigma <span class="org-keyword">import</span> Sigma
<span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, ui, Session

<span class="org-keyword">from</span> navigator.utils <span class="org-keyword">import</span> trace

<span class="org-variable-name">INITIAL_NUM_NODES</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> ui.page_fluid(
    ui.h2(<span class="org-string">"Ipysigma Graph (Core API), full redraw"</span>),
    ui.input_numeric(<span class="org-string">"num_nodes"</span>, <span class="org-string">"Number of nodes:"</span>, value<span class="org-operator">=</span>INITIAL_NUM_NODES, <span class="org-builtin">min</span><span class="org-operator">=</span>1),
    sw.output_widget(<span class="org-string">"graph_output"</span>),
)

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>, _output, _session: Session):
    <span class="org-comment-delimiter"># </span><span class="org-comment">pyright: ignore[reportUnusedFunction=false]</span>
    <span class="org-type">@sw.render_widget</span>
    <span class="org-type">@trace</span>
    <span class="org-keyword">def</span> <span class="org-function-name">graph_output</span>():
        <span class="org-variable-name">num_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">input</span>.num_nodes()
        <span class="org-variable-name">nx_graph</span> <span class="org-operator">=</span> nx.complete_graph(num_nodes)

        <span class="org-variable-name">widget</span> <span class="org-operator">=</span> Sigma(nx_graph)
        <span class="org-keyword">return</span> widget

<span class="org-variable-name">app</span> <span class="org-operator">=</span> App(app_ui, server)
</pre>
</div>
</div>
</div>
