navigator.org
******* ipysigma Shiny Core node navigator

        This is a Shiny Core App that displays an ipysigma Graph,
        with the choice of nodes displayed driven by
        the user's selection of nodes on the displayed graph.
        Initially no nodes are selected,
        and in this state the entire underlying graph is shown.
        When the user selects a node, then
        the displayed graph is restricted to the selected node and its neighbors.
        When this happens the graph is re-rendered completely,
        including recomputing its layout.
        The layout is determined by ipysigma's default layout engine.

        It can be run with
        #+begin_src bash
          shiny run --reload --log-level debug src/navigator/ipysigma_core_navigator.py
        #+end_src

        #+NAME: ipysigma_core_navigator
        #+begin_src python :tangle src/navigator/ipysigma_core_navigator.py
          import os
          from typing import cast

          import ipywidgets
          import pandas as pd
          import shiny
          import shinywidgets
          import networkx as nx
          from ipysigma import Sigma
          from shiny import App, ui, Session

          import navigator.graph_utils as graph_utils

          app_ui = ui.page_fluid(
              ui.h2("Ipysigma Graph (Core API), node navigator"),
              shinywidgets.output_widget('graph_output'),
              ui.output_text('selected_node_description'),
              ui.output_table('node_data')
          )


          def server(_input, _output, _session: Session):
              initial_num_nodes: int = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))
              base_graph: nx.Graph = graph_utils.create_cycle_graph(n=initial_num_nodes)
              selected_node_reactive = shiny.reactive.Value[int | None](None)

              @shinywidgets.render_widget
              def graph_output() -> Sigma:
                  """Return the ipysigma graph to render.

                  Reactive reads:
                    selected_node_reactive
                  """
                  selected_node = selected_node_reactive.get()
                  if selected_node is None:
                      graph = base_graph
                      extra_kwargs = {}
                  else:
                      graph = graph_utils.node_and_neighbors(base_graph, selected_node)
                      extra_kwargs = dict(selected_node=selected_node)

                  return Sigma(
                      graph,
                      start_layout=5,
                      raw_node_size=lambda _: 24,
                      raw_node_border_size=lambda _: 4,
                      raw_node_border_color=lambda _: 'blue',
                      show_all_labels=True,
                      raw_node_label_size=lambda _: 18,
                      raw_edge_size=lambda _: 4,
                      raw_edge_color=lambda: 'red',
                      **extra_kwargs
                  )

              @shiny.render.text
              def selected_node_description() -> str:
                  """Return a text description of the selected node.

                  Reactive reads:
                    graph_output.widget

                  Reactive sets:
                    focus_node_reactive
                  """
                  widget = cast(ipywidgets.Widget, graph_output.widget)
                  selected_node_read = shinywidgets.reactive_read(widget, names="selected_node")
                  selected_node: int | None = (
                      int(selected_node_read) if selected_node_read is not None else None
                  )
                  selected_node_reactive.set(value=selected_node)
                  return f"The selected node is: {selected_node}"

              @shiny.render.table
              def node_data() -> pd.DataFrame:  # pyright: ignore[reportUnusedFunction]
                  """Return a DataFrame with data about the selected node.

                  Reactive reads:
                    focus_node_reactive
                  """
                  selected_node = selected_node_reactive.get()
                  if selected_node is not None:
                      # Generate some example data for the selected node
                      data = {
                          "Attribute": ["Node", "Degree", "Clustering Coefficient"],
                          "Value": [
                              selected_node,
                              nx.degree(base_graph, selected_node),
                              nx.clustering(base_graph, selected_node)
                          ]
                      }
                      df = pd.DataFrame(data)
                  else:
                      # Return an empty DataFrame as a placeholder
                      df = pd.DataFrame(columns=["Attribute", "Value"])
                  return df


          app = App(app_ui, server)
        #+end_src

