navigator.html
<div id="outline-container-orga564766" class="outline-5">
<h5 id="orga564766">ipysigma Shiny Core node navigator</h5>
<div class="outline-text-5" id="text-orga564766">
<p>
This is a Shiny Core App that displays an ipysigma Graph,
with the choice of nodes displayed driven by
the user's selection of nodes on the displayed graph.
Initially no nodes are selected,
and in this state the entire underlying graph is shown.
When the user selects a node, then
the displayed graph is restricted to the selected node and its neighbors.
When this happens the graph is re-rendered completely,
including recomputing its layout.
The layout is determined by ipysigma's default layout engine.
</p>

<p>
It can be run with
</p>
<div class="org-src-container">
<pre class="src src-bash">shiny run --reload --log-level debug src/navigator/ipysigma_core_navigator.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="org72f25ba"><span class="org-keyword">import</span> os
<span class="org-keyword">from</span> typing <span class="org-keyword">import</span> cast

<span class="org-keyword">import</span> ipywidgets
<span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-keyword">import</span> shiny
<span class="org-keyword">import</span> shinywidgets
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> ipysigma <span class="org-keyword">import</span> Sigma
<span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, ui, Session

<span class="org-keyword">import</span> navigator.graph_utils <span class="org-keyword">as</span> graph_utils

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> ui.page_fluid(
    ui.h2(<span class="org-string">"Ipysigma Graph (Core API), node navigator"</span>),
    shinywidgets.output_widget(<span class="org-string">'graph_output'</span>),
    ui.output_text(<span class="org-string">'selected_node_description'</span>),
    ui.output_table(<span class="org-string">'node_data'</span>)
)


<span class="org-keyword">def</span> <span class="org-function-name">server</span>(_input, _output, _session: Session):
    <span class="org-variable-name">initial_num_nodes</span>: <span class="org-builtin">int</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))
    <span class="org-variable-name">base_graph</span>: <span class="org-type">nx</span>.<span class="org-type">Graph</span> <span class="org-operator">=</span> graph_utils.create_cycle_graph(n<span class="org-operator">=</span>initial_num_nodes)
    <span class="org-variable-name">selected_node_reactive</span> <span class="org-operator">=</span> shiny.reactive.Value[<span class="org-builtin">int</span> <span class="org-operator">|</span> <span class="org-constant">None</span>](<span class="org-constant">None</span>)

    <span class="org-type">@shinywidgets.render_widget</span>
    <span class="org-keyword">def</span> <span class="org-function-name">graph_output</span>() <span class="org-operator">-&gt;</span> Sigma:
        <span class="org-doc">"""Return the ipysigma graph to render.</span>

<span class="org-doc">        Reactive reads:</span>
<span class="org-doc">          selected_node_reactive</span>
<span class="org-doc">        """</span>
        <span class="org-variable-name">selected_node</span> <span class="org-operator">=</span> selected_node_reactive.get()
        <span class="org-keyword">if</span> selected_node <span class="org-keyword">is</span> <span class="org-constant">None</span>:
            <span class="org-variable-name">graph</span> <span class="org-operator">=</span> base_graph
            <span class="org-variable-name">extra_kwargs</span> <span class="org-operator">=</span> {}
        <span class="org-keyword">else</span>:
            <span class="org-variable-name">graph</span> <span class="org-operator">=</span> graph_utils.node_and_neighbors(base_graph, selected_node)
            <span class="org-variable-name">extra_kwargs</span> <span class="org-operator">=</span> <span class="org-builtin">dict</span>(selected_node<span class="org-operator">=</span>selected_node)

        <span class="org-keyword">return</span> Sigma(
            graph,
            start_layout<span class="org-operator">=</span>5,
            raw_node_size<span class="org-operator">=</span><span class="org-keyword">lambda</span> _: 24,
            raw_node_border_size<span class="org-operator">=</span><span class="org-keyword">lambda</span> _: 4,
            raw_node_border_color<span class="org-operator">=</span><span class="org-keyword">lambda</span> _: <span class="org-string">'blue'</span>,
            show_all_labels<span class="org-operator">=</span><span class="org-constant">True</span>,
            raw_node_label_size<span class="org-operator">=</span><span class="org-keyword">lambda</span> _: 18,
            raw_edge_size<span class="org-operator">=</span><span class="org-keyword">lambda</span> _: 4,
            raw_edge_color<span class="org-operator">=</span><span class="org-keyword">lambda</span>: <span class="org-string">'red'</span>,
            <span class="org-operator">**</span>extra_kwargs
        )

    <span class="org-type">@shiny.render.text</span>
    <span class="org-keyword">def</span> <span class="org-function-name">selected_node_description</span>() <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
        <span class="org-doc">"""Return a text description of the selected node.</span>

<span class="org-doc">        Reactive reads:</span>
<span class="org-doc">          graph_output.widget</span>

<span class="org-doc">        Reactive sets:</span>
<span class="org-doc">          focus_node_reactive</span>
<span class="org-doc">        """</span>
        <span class="org-variable-name">widget</span> <span class="org-operator">=</span> cast(ipywidgets.Widget, graph_output.widget)
        <span class="org-variable-name">selected_node_read</span> <span class="org-operator">=</span> shinywidgets.reactive_read(widget, names<span class="org-operator">=</span><span class="org-string">"selected_node"</span>)
        selected_node: <span class="org-builtin">int</span> <span class="org-operator">|</span> <span class="org-constant">None</span> <span class="org-operator">=</span> (
            <span class="org-builtin">int</span>(selected_node_read) <span class="org-keyword">if</span> selected_node_read <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-constant">None</span> <span class="org-keyword">else</span> <span class="org-constant">None</span>
        )
        selected_node_reactive.<span class="org-builtin">set</span>(value<span class="org-operator">=</span>selected_node)
        <span class="org-keyword">return</span> f<span class="org-string">"The selected node is: </span>{selected_node}<span class="org-string">"</span>

    <span class="org-type">@shiny.render.table</span>
    <span class="org-keyword">def</span> <span class="org-function-name">node_data</span>() <span class="org-operator">-&gt;</span> pd.DataFrame:  <span class="org-comment-delimiter"># </span><span class="org-comment">pyright: ignore[reportUnusedFunction]</span>
        <span class="org-doc">"""Return a DataFrame with data about the selected node.</span>

<span class="org-doc">        Reactive reads:</span>
<span class="org-doc">          focus_node_reactive</span>
<span class="org-doc">        """</span>
        <span class="org-variable-name">selected_node</span> <span class="org-operator">=</span> selected_node_reactive.get()
        <span class="org-keyword">if</span> selected_node <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-constant">None</span>:
            <span class="org-comment-delimiter"># </span><span class="org-comment">Generate some example data for the selected node</span>
            <span class="org-variable-name">data</span> <span class="org-operator">=</span> {
                <span class="org-string">"Attribute"</span>: [<span class="org-string">"Node"</span>, <span class="org-string">"Degree"</span>, <span class="org-string">"Clustering Coefficient"</span>],
                <span class="org-string">"Value"</span>: [
                    selected_node,
                    nx.degree(base_graph, selected_node),
                    nx.clustering(base_graph, selected_node)
                ]
            }
            <span class="org-variable-name">df</span> <span class="org-operator">=</span> pd.DataFrame(data)
        <span class="org-keyword">else</span>:
            <span class="org-comment-delimiter"># </span><span class="org-comment">Return an empty DataFrame as a placeholder</span>
            <span class="org-variable-name">df</span> <span class="org-operator">=</span> pd.DataFrame(columns<span class="org-operator">=</span>[<span class="org-string">"Attribute"</span>, <span class="org-string">"Value"</span>])
        <span class="org-keyword">return</span> df


<span class="org-variable-name">app</span> <span class="org-operator">=</span> App(app_ui, server)
</pre>
</div>
</div>
</div>
</div>
