navigator.org
***** Conclusion
      The combination of ipysigma with Shiny for Python is a viable candidate to build on.

      Importantly, ipysigma appears to be robust enough to work with.
      Unlike ipycytoscape, the core functionality seems to work,
      and implementing the core functionality needed for output navigation
      was straightforward to do within Shiny's paradigms.
      Notably, the package seems to have been developed by people who use it for network analysis,
      rather than as an exercise in wrapping tools for others.

      The main downside of the package is that it is relatively unpopular and
      the maintenance is sporadic, with a small group of maintainers,
      a low (but non-zero) rate of commits and
      a significant number of bugs outstanding;
      there were 15 at the time of writing with some in quite basic areas like [[https://github.com/medialab/ipysigma/issues/129][svg export]].

      A secondary downside is that the general appearance is quite "geeky" and less
      polished than the containers available through Bokeh, Plotly, etc.

*** Using pyvis
***** pyvis Shiny Core node navigator

      This is a Shiny Core App that displays a graph using pyvis.

      It's based on https://github.com/posit-dev/py-shinywidgets/issues/63

      It can be run with
      #+begin_src bash
        shiny run --reload --log-level debug src/navigator/pyvis_core_navigator.py
      #+end_src

      Note that pyvis operates, as here, by saving an HTML file.
      Nothing in the documentation at
      https://pyvis.readthedocs.io/en/latest/documentation.html
      indicates that any other mode is supported.

      #+NAME: pyvis_core_navigator
      #+begin_src python :tangle src/navigator/pyvis_core_navigator.py
        import os
        from pathlib import Path

        import shiny
        import networkx as nx
        from pyvis.network import Network
        from shiny import App, ui

        import navigator.graph_utils as graph_utils

        # Use a static_assets folder for holding the Network()'s html file

        WWW = Path(__file__).resolve().parent.parent / "www"

        PYVIS_OUTPUT_ID = "pyvis"

        app_ui = ui.page_fluid(
            ui.output_ui(PYVIS_OUTPUT_ID),
        )

        def server(input: shiny.Inputs, output: shiny.Outputs, _session: shiny.Session):
            initial_num_nodes: int = int(os.environ.get("NAVIGATOR_INITIAL_NUM_NODES", 5))

            @output(id=PYVIS_OUTPUT_ID)
            @shiny.render.ui
            def _():
                G: nx.Graph = graph_utils.create_cycle_graph(n=initial_num_nodes)
                net = Network()
                net.from_nx(G)
                net.toggle_drag_nodes(True)

                f = WWW / f"{PYVIS_OUTPUT_ID}.html"
                new_content = net.generate_html(local=False)

                try:
                    current_content = f.read_text()
                except FileNotFoundError:
                    current_content = None

                # avoid triggering an endless loop of reloads because a watched file changes
                if new_content != current_content:
                    f.write_text(new_content)

                return ui.tags.iframe(
                    src=PYVIS_OUTPUT_ID + ".html",
                    style="height:600px;width:100%;",
                    scrolling="no",
                    seamless="seamless",
                    frameBorder="0",
                )

        app = App(app_ui, server, static_assets=WWW)
      #+end_src
***** Conclusion
      pyvis is not a useful option given how it operates using external HTML files,
      although the underlying VisJS library might be useful.
*** D3
