navigator.html
<div id="outline-container-org31186a9" class="outline-4">
<h4 id="org31186a9">Conclusion</h4>
<div class="outline-text-4" id="text-org31186a9">
<p>
The combination of ipysigma with Shiny for Python is a viable candidate to build on.
</p>

<p>
Importantly, ipysigma appears to be robust enough to work with.
Unlike ipycytoscape, the core functionality seems to work,
and implementing the core functionality needed for output navigation
was straightforward to do within Shiny's paradigms.
Notably, the package seems to have been developed by people who use it for network analysis,
rather than as an exercise in wrapping tools for others.
</p>

<p>
The main downside of the package is that it is relatively unpopular and
the maintenance is sporadic, with a small group of maintainers,
a low (but non-zero) rate of commits and
a significant number of bugs outstanding;
there were 15 at the time of writing with some in quite basic areas like <a href="https://github.com/medialab/ipysigma/issues/129">svg export</a>.
</p>

<p>
A secondary downside is that the general appearance is quite "geeky" and less
polished than the containers available through Bokeh, Plotly, etc.
</p>
</div>
</div>
</div>
<div id="outline-container-org27e7009" class="outline-3">
<h3 id="org27e7009">Using pyvis</h3>
<div class="outline-text-3" id="text-org27e7009">
</div>
<div id="outline-container-org1bd80bf" class="outline-4">
<h4 id="org1bd80bf">pyvis Shiny Core node navigator</h4>
<div class="outline-text-4" id="text-org1bd80bf">
<p>
This is a Shiny Core App that displays a graph using pyvis.
</p>

<p>
It's based on <a href="https://github.com/posit-dev/py-shinywidgets/issues/63">https://github.com/posit-dev/py-shinywidgets/issues/63</a>
</p>

<p>
It can be run with
</p>
<div class="org-src-container">
<pre class="src src-bash">shiny run --reload --log-level debug src/navigator/pyvis_core_navigator.py
</pre>
</div>

<p>
Note that pyvis operates, as here, by saving an HTML file.
Nothing in the documentation at
<a href="https://pyvis.readthedocs.io/en/latest/documentation.html">https://pyvis.readthedocs.io/en/latest/documentation.html</a>
indicates that any other mode is supported.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org15add4a"><span class="org-keyword">import</span> os
<span class="org-keyword">from</span> pathlib <span class="org-keyword">import</span> Path

<span class="org-keyword">import</span> shiny
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> pyvis.network <span class="org-keyword">import</span> Network
<span class="org-keyword">from</span> shiny <span class="org-keyword">import</span> App, ui

<span class="org-keyword">import</span> navigator.graph_utils <span class="org-keyword">as</span> graph_utils

<span class="org-comment-delimiter"># </span><span class="org-comment">Use a static_assets folder for holding the Network()'s html file</span>

<span class="org-variable-name">WWW</span> <span class="org-operator">=</span> Path(__file__).resolve().parent.parent <span class="org-operator">/</span> <span class="org-string">"www"</span>

<span class="org-variable-name">PYVIS_OUTPUT_ID</span> <span class="org-operator">=</span> <span class="org-string">"pyvis"</span>

<span class="org-variable-name">app_ui</span> <span class="org-operator">=</span> ui.page_fluid(
    ui.output_ui(PYVIS_OUTPUT_ID),
)

<span class="org-keyword">def</span> <span class="org-function-name">server</span>(<span class="org-builtin">input</span>: shiny.Inputs, output: shiny.Outputs, _session: shiny.Session):
    <span class="org-variable-name">initial_num_nodes</span>: <span class="org-builtin">int</span> <span class="org-operator">=</span> <span class="org-builtin">int</span>(os.environ.get(<span class="org-string">"NAVIGATOR_INITIAL_NUM_NODES"</span>, 5))

    <span class="org-type">@output</span>(<span class="org-builtin">id</span><span class="org-operator">=</span>PYVIS_OUTPUT_ID)
    <span class="org-type">@shiny.render.ui</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_</span>():
        <span class="org-variable-name">G</span>: <span class="org-type">nx</span>.<span class="org-type">Graph</span> <span class="org-operator">=</span> graph_utils.create_cycle_graph(n<span class="org-operator">=</span>initial_num_nodes)
        <span class="org-variable-name">net</span> <span class="org-operator">=</span> Network()
        net.from_nx(G)
        net.toggle_drag_nodes(<span class="org-constant">True</span>)

        <span class="org-variable-name">f</span> <span class="org-operator">=</span> WWW <span class="org-operator">/</span> f<span class="org-string">"</span>{PYVIS_OUTPUT_ID}<span class="org-string">.html"</span>
        <span class="org-variable-name">new_content</span> <span class="org-operator">=</span> net.generate_html(local<span class="org-operator">=</span><span class="org-constant">False</span>)

        <span class="org-keyword">try</span>:
            <span class="org-variable-name">current_content</span> <span class="org-operator">=</span> f.read_text()
        <span class="org-keyword">except</span> <span class="org-type">FileNotFoundError</span>:
            <span class="org-variable-name">current_content</span> <span class="org-operator">=</span> <span class="org-constant">None</span>

        <span class="org-comment-delimiter"># </span><span class="org-comment">avoid triggering an endless loop of reloads because a watched file changes</span>
        <span class="org-keyword">if</span> new_content <span class="org-operator">!=</span> current_content:
            f.write_text(new_content)

        <span class="org-keyword">return</span> ui.tags.iframe(
            src<span class="org-operator">=</span>PYVIS_OUTPUT_ID <span class="org-operator">+</span> <span class="org-string">".html"</span>,
            style<span class="org-operator">=</span><span class="org-string">"height:600px;width:100%;"</span>,
            scrolling<span class="org-operator">=</span><span class="org-string">"no"</span>,
            seamless<span class="org-operator">=</span><span class="org-string">"seamless"</span>,
            frameBorder<span class="org-operator">=</span><span class="org-string">"0"</span>,
        )

<span class="org-variable-name">app</span> <span class="org-operator">=</span> App(app_ui, server, static_assets<span class="org-operator">=</span>WWW)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ecb917" class="outline-4">
<h4 id="org9ecb917">Conclusion</h4>
<div class="outline-text-4" id="text-org9ecb917">
<p>
pyvis is not a useful option given how it operates using external HTML files,
although the underlying VisJS library might be useful.
</p>
</div>
</div>
</div>
