navigator.org
*** Debugging Shiny
    :PROPERTIES:
    :ID:       5274a82c-1ba9-4104-ab93-74d8df07fbbf
    :END:
***** Websockets logging
      :PROPERTIES:
      :ID:       71f33094-70aa-4840-be84-db4ce2bbb4b0
      :END:
      - https://websockets.readthedocs.io/en/stable/topics/logging.html
      - https://websockets.readthedocs.io/en/stable/reference/variables.html

      Shiny uses websockets for communication.
      To increase log verbosity and avoid truncating messages we can run
      #+begin_src bash
      export WEBSOCKETS_MAX_LOG_SIZE=10000
      #+end_src

* Utilities
*** Generic utilities
    :PROPERTIES:
    :ID:       57d6dd31-2614-4297-abe0-6ccaa246e377
    :END:

    We will need some utilities for debugging.
    #+begin_src python :tangle src/navigator/utils.py
      import functools
      import sys
      from pathlib import Path


      def trace(func):
          @functools.wraps(func)
          def traced(*args, **kwargs):
              func_name = func.__name__

              arg_str = ", ".join(repr(arg) for arg in args)
              kwarg_str = ", ".join(f"{key}={repr(value)}" for key, value in kwargs.items())
              all_args = ", ".join(filter(None, [arg_str, kwarg_str]))

              print(f"TRACE: Entering {func_name}({all_args})")

              try:
                  result = func(*args, **kwargs)
                  print(f"TRACE: Exiting {func_name} with result: {repr(result)}")
                  return result
              except Exception as e:
                  print(f"TRACE: Exiting {func_name} with exception: {e=}")
                  raise

          return traced


      def log_mouseovers(node):
          print(f"mouseover: {node}")


      def log_clicks(node):
          print(f"click: {node}")

      def print_traits(widget):
          """Print the traits for an ipython widget
          """
          print([t for t in widget.traits()
                 if not str(t).startswith('_')])

      def bind_to_name(name: str):
          """
          A decorator that binds the decorated function to a specified string name
          at the module/global level.

          The function will be accessible via its original name and the new bound name.

          Args:
              name: The name to bind the function to at global scope.
          """
          if not isinstance(name, str):
              raise TypeError("The name argument must be a string.")

          def decorator(func):
              @functools.wraps(func)
              def wrapper(*args, **kwargs):
                  return func(*args, **kwargs)
              globals()[name] = func
              return wrapper

          return decorator
    #+end_src

*** Graph utilities
    We'll need some generic graph utilities; we'll build these on networkx for now.

    #+begin_src python :tangle src/navigator/graph_utils.py
      from typing import Any
      import networkx as nx

      def create_cycle_graph(n)-> nx.Graph:
          """
          Creates a circular graph with nodes valued from 0 to n-1,
          where each node is connected to its successor and predecessor mod n.

          Args:
            n: The number of nodes in the graph.

          Returns:
            A NetworkX graph object representing the circular graph.
          """
          G = nx.cycle_graph(n)

          return G

      def node_and_neighbors(graph: nx.Graph, node: Any) -> nx.Graph:
        """
        Returns a subgraph consisting of the given node and all its immediate neighbors.

        Args:
          graph: The input NetworkX undirected graph.
          node: The node within the graph for which to get the subgraph.

        Returns:
          A NetworkX graph object representing the subgraph containing the
          specified node and its neighbors.

        Raises:
          nx.NetworkXError: If the specified node is not in the graph.
        """
        if node not in graph:
          raise nx.NetworkXError(f"Node {node} is not in the graph.")

        subgraph_nodes = list(graph.neighbors(node)) + [node]

        return graph.subgraph(subgraph_nodes)
    #+end_src

*** Data providers
