navigator.html
<div id="outline-container-orgfd941b3" class="outline-3">
<h3 id="orgfd941b3">Debugging Shiny</h3>
<div class="outline-text-3" id="text-orgfd941b3">
</div>
<div id="outline-container-org971cc7d" class="outline-4">
<h4 id="org971cc7d">Websockets logging</h4>
<div class="outline-text-4" id="text-org971cc7d">
<ul class="org-ul">
<li><a href="https://websockets.readthedocs.io/en/stable/topics/logging.html">https://websockets.readthedocs.io/en/stable/topics/logging.html</a></li>
<li><a href="https://websockets.readthedocs.io/en/stable/reference/variables.html">https://websockets.readthedocs.io/en/stable/reference/variables.html</a></li>
</ul>

<p>
Shiny uses websockets for communication.
To increase log verbosity and avoid truncating messages we can run
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-builtin">export</span> <span class="org-variable-name">WEBSOCKETS_MAX_LOG_SIZE</span>=10000
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org0336711" class="outline-2">
<h2 id="org0336711">Utilities</h2>
<div class="outline-text-2" id="text-org0336711">
</div>
<div id="outline-container-org3aead1c" class="outline-3">
<h3 id="org3aead1c">Generic utilities</h3>
<div class="outline-text-3" id="text-org3aead1c">
<p>
We will need some utilities for debugging.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> functools
<span class="org-keyword">import</span> sys
<span class="org-keyword">from</span> pathlib <span class="org-keyword">import</span> Path


<span class="org-keyword">def</span> <span class="org-function-name">trace</span>(func):
    <span class="org-type">@functools.wraps</span>(func)
    <span class="org-keyword">def</span> <span class="org-function-name">traced</span>(<span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs):
        <span class="org-variable-name">func_name</span> <span class="org-operator">=</span> func.<span class="org-builtin">__name__</span>

        <span class="org-variable-name">arg_str</span> <span class="org-operator">=</span> <span class="org-string">", "</span>.join(<span class="org-builtin">repr</span>(arg) <span class="org-keyword">for</span> arg <span class="org-keyword">in</span> args)
        <span class="org-variable-name">kwarg_str</span> <span class="org-operator">=</span> <span class="org-string">", "</span>.join(f<span class="org-string">"</span>{key}<span class="org-string">=</span>{<span class="org-builtin">repr</span>(value)}<span class="org-string">"</span> <span class="org-keyword">for</span> key, value <span class="org-keyword">in</span> kwargs.items())
        <span class="org-variable-name">all_args</span> <span class="org-operator">=</span> <span class="org-string">", "</span>.join(<span class="org-builtin">filter</span>(<span class="org-constant">None</span>, [arg_str, kwarg_str]))

        <span class="org-builtin">print</span>(f<span class="org-string">"TRACE: Entering </span>{func_name}<span class="org-string">(</span>{all_args}<span class="org-string">)"</span>)

        <span class="org-keyword">try</span>:
            <span class="org-variable-name">result</span> <span class="org-operator">=</span> func(<span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs)
            <span class="org-builtin">print</span>(f<span class="org-string">"TRACE: Exiting </span>{func_name}<span class="org-string"> with result: </span>{<span class="org-builtin">repr</span>(result)}<span class="org-string">"</span>)
            <span class="org-keyword">return</span> result
        <span class="org-keyword">except</span> <span class="org-type">Exception</span> <span class="org-keyword">as</span> e:
            <span class="org-builtin">print</span>(f<span class="org-string">"TRACE: Exiting </span>{func_name}<span class="org-string"> with exception: </span>{e<span class="org-operator">=</span>}<span class="org-string">"</span>)
            <span class="org-keyword">raise</span>

    <span class="org-keyword">return</span> traced


<span class="org-keyword">def</span> <span class="org-function-name">log_mouseovers</span>(node):
    <span class="org-builtin">print</span>(f<span class="org-string">"mouseover: </span>{node}<span class="org-string">"</span>)


<span class="org-keyword">def</span> <span class="org-function-name">log_clicks</span>(node):
    <span class="org-builtin">print</span>(f<span class="org-string">"click: </span>{node}<span class="org-string">"</span>)

<span class="org-keyword">def</span> <span class="org-function-name">print_traits</span>(widget):
    <span class="org-doc">"""Print the traits for an ipython widget</span>
<span class="org-doc">    """</span>
    <span class="org-builtin">print</span>([t <span class="org-keyword">for</span> t <span class="org-keyword">in</span> widget.traits()
           <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-builtin">str</span>(t).startswith(<span class="org-string">'_'</span>)])

<span class="org-keyword">def</span> <span class="org-function-name">bind_to_name</span>(name: <span class="org-builtin">str</span>):
    <span class="org-doc">"""</span>
<span class="org-doc">    A decorator that binds the decorated function to a specified string name</span>
<span class="org-doc">    at the module/global level.</span>

<span class="org-doc">    The function will be accessible via its original name and the new bound name.</span>

<span class="org-doc">    Args:</span>
<span class="org-doc">        name: The name to bind the function to at global scope.</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-builtin">isinstance</span>(name, <span class="org-builtin">str</span>):
        <span class="org-keyword">raise</span> <span class="org-type">TypeError</span>(<span class="org-string">"The name argument must be a string."</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">decorator</span>(func):
        <span class="org-type">@functools.wraps</span>(func)
        <span class="org-keyword">def</span> <span class="org-function-name">wrapper</span>(<span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs):
            <span class="org-keyword">return</span> func(<span class="org-operator">*</span>args, <span class="org-operator">**</span>kwargs)
        <span class="org-builtin">globals</span>()[name] <span class="org-operator">=</span> func
        <span class="org-keyword">return</span> wrapper

    <span class="org-keyword">return</span> decorator
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb695e04" class="outline-3">
<h3 id="orgb695e04">Graph utilities</h3>
<div class="outline-text-3" id="text-orgb695e04">
<p>
We'll need some generic graph utilities; we'll build these on networkx for now.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> typing <span class="org-keyword">import</span> Any
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx

<span class="org-keyword">def</span> <span class="org-function-name">create_cycle_graph</span>(n)<span class="org-operator">-&gt;</span> nx.Graph:
    <span class="org-doc">"""</span>
<span class="org-doc">    Creates a circular graph with nodes valued from 0 to n-1,</span>
<span class="org-doc">    where each node is connected to its successor and predecessor mod n.</span>

<span class="org-doc">    Args:</span>
<span class="org-doc">      n: The number of nodes in the graph.</span>

<span class="org-doc">    Returns:</span>
<span class="org-doc">      A NetworkX graph object representing the circular graph.</span>
<span class="org-doc">    """</span>
    <span class="org-variable-name">G</span> <span class="org-operator">=</span> nx.cycle_graph(n)

    <span class="org-keyword">return</span> G

<span class="org-keyword">def</span> <span class="org-function-name">node_and_neighbors</span>(graph: nx.Graph, node: Any) <span class="org-operator">-&gt;</span> nx.Graph:
  <span class="org-doc">"""</span>
<span class="org-doc">  Returns a subgraph consisting of the given node and all its immediate neighbors.</span>

<span class="org-doc">  Args:</span>
<span class="org-doc">    graph: The input NetworkX undirected graph.</span>
<span class="org-doc">    node: The node within the graph for which to get the subgraph.</span>

<span class="org-doc">  Returns:</span>
<span class="org-doc">    A NetworkX graph object representing the subgraph containing the</span>
<span class="org-doc">    specified node and its neighbors.</span>

<span class="org-doc">  Raises:</span>
<span class="org-doc">    nx.NetworkXError: If the specified node is not in the graph.</span>
<span class="org-doc">  """</span>
  <span class="org-keyword">if</span> node <span class="org-keyword">not</span> <span class="org-keyword">in</span> graph:
    <span class="org-keyword">raise</span> nx.NetworkXError(f<span class="org-string">"Node </span>{node}<span class="org-string"> is not in the graph."</span>)

  <span class="org-variable-name">subgraph_nodes</span> <span class="org-operator">=</span> <span class="org-builtin">list</span>(graph.neighbors(node)) <span class="org-operator">+</span> [node]

  <span class="org-keyword">return</span> graph.subgraph(subgraph_nodes)
</pre>
</div>
</div>
</div>
