navigator.org
***** Shakespeare data

      #+NAME: shakespeare_data
      #+begin_src python :tangle src/navigator/shakespeare.py
        import re
        import warnings
        from itertools import combinations
        from typing import Any, Iterable

        import pandas as pd
        import pandas.testing as pdt
        import networkx as nx
        from thefuzz import process as thefuzz_process


        def calculate_candidate_character_replacements(
            character_names: pd.Series, min_similarity_score: int
        ) -> dict[str, str]:
            """Calculate candidate replacements to clean a Series of character names by
            standardizing strings using fuzzy matching.

            Args:

                series: The input Series.

                min_similarity_score: The minimum fuzzy matching score (0-100) to consider a
                    string a potential match.

            Returns:
                A mapping from current character names to cleaned ones, where these are different
            """

            def strip_name(name: str) -> str:
                name = name.strip()
                name = re.sub(r"  +", " ", name)
                name = re.sub(r"[^a-zA-Z]+$", "", name)
                return name

            def best_match(
                name: str, stripped_names: Iterable[str], min_similarity_score: int
            ) -> str:
                stripped_name = strip_name(name)
                extracted = thefuzz_process.extractOne(stripped_name, stripped_names)
                if extracted is None:
                    return stripped_name
                best_match, score = extracted
                if score < min_similarity_score:
                    return stripped_name
                else:
                    return best_match

            replacements = {}
            replacement_values = set()
            for name in character_names.value_counts().index:  # most frequent values first
                replacements[name] = best_match(name, replacement_values, min_similarity_score)
                replacement_values.add(replacements[name])

            return {
                name: mapped_name
                for name, mapped_name in replacements.items()
                if name != mapped_name
            }


        class CharacterNetwork:
            REQUIRED_COLUMNS = "play_name,genre,character,act,scene,sentence,text,sex".split(
                ","
            )

            KNOWN_CHARACTER_FIXES: dict[str, dict[str, str]] = {
                "Richard III": {
                    "Of Buckingham": "Ghost of Buckingham",
                    "Of Prince Edward": "Ghost of Prince Edward",
                },
                "Henry VI, part 1": {"Su Ffolk": "Suffolk"},
                "Othello": {"Second Gentlemen": "Second Gentleman"},
                "Romeo and Juliet": {"Lady  Capulet": "Lady Capulet"},
                "Hamlet": {
                    "Guildenstern:": "Guildenstern",
                    "Rosencrantz:": "Rosencrantz",
                },
                "Taming of the Shrew": {"Katarina": "Katharina"},
                "Henry VI, part 2": {"First Murder": "First Murderer"},
                "Measure for Measure": {"Pomphey": "Pompey"},
            }

            KNOWN_CHARACTER_NON_FIXES: set[tuple[str, str]] = {
                ("Antony and Cleopatra", "Attendants"),
                ("Coriolanus", "Citizen"),
                ("Henry IV, part 2", "King Henry V"),
                ("Henry VI, part 2", "Servant"),
                ("Timon of Athens", "Servants"),
            }

            # Names not referring to definite characters.  These are not so interesting to look at
            # and may represent different people.
            INDEFINITE_NAMES = [
                '& C',
                'A Lord',
                'A Patrician',
                'A Player',
                'All',
                'All Citizens',
                'All Conspirators',
                'All Ladies',
                'All Lords',
                'All Servants',
                'All The Goths',
                'All The Lords',
                'All The People',
                'Another',
                'As Long As You Or I',
                'Attendant',
                'Attendants',
                'Both Citizens',
                'Both Murderers',
                'Both Tribunes',
                'Boy',
                'Captain',
                'Children',
                'Chorus',
                'Citizen',
                'Citizens',
                'Clown',
                'Commons',
                'Court',
                'Courtezan',
                'Crier',
                'Gentleman',
                'Gentlemen',
                'Gentlewoman',
                'Girl',
                'Guard',
                'Knight',
                'Knights',
                'Lady',
                'Lieutenant',
                'Lord',
                'Lords',
                'Man',
                'Merchant',
                'Messenger',
                'Mother',
                'Musician',
                'Nobleman',
                'Nurse',
                'Officer',
                'Old Athenian',
                'Old Lady',
                'Old Man',
                'Outlaws',
                'Page',
                'Players',
                'Prince',
                'Princes',
                'Princess',
                'Prologue',
                'Sailor',
                'Scout',
                'Senator',
                'Senators',
                'Sergeant',
                'Servant',
                'Servants',
                'Shepard',
                'Shepherd',
                'Sheriff',
                'Soldier',
                'Soldiers',
                'Some Others',
                'Some Speak',
                'Soothsayer',
                'Steward',
                'Townsman',
                'Travellers',
                'Watch',
                'Watchman',
                'Wife',
            ]


            def __init__(self, df: pd.DataFrame, min_similarity_score: int = 92):
                """Initializes the CharacterNetwork with a dataframe containing character
                interactions in Shakespeare's plays.

                Nodes represent a unique character within a specific play (e.g., 'play-name-character').
                Edges connect characters who speak in the same scene.

                Args:
                    df: The dataframe, with columns:
                    - play_name
                    - genre
                    - act
                    - scene
                    - character
                    - sex
                    - sentence
                    - text

                    min_similarity_score: minimum Levenshtein-based similarity score to warn if
                       character name matches are found for
                """
                self.df = CharacterNetwork.clean_playdata(df, min_similarity_score)
                self.graph = CharacterNetwork._build_shakespeare_network(self.df)
                self.play_names = sorted(set(df["play_name"]))

            @staticmethod
            def clean_playdata(df: pd.DataFrame, min_similarity_score: int) -> pd.DataFrame:
                """Return a cleaned version of df.

                Character names are replaced based on previously checked replacements.

                Warnings are issued if there are any candidate replacements not among those
                previously known or ruled out, based on a fuzzy-matching analysis of the character
                names.

                Args:

                  min_similarity_score: the threshold above which character names are
                    candidates for consolidation. Corresponds to the score returned from
                    `thefuzz.process.extractOne`.
                """
                assert set(df.columns) == set(CharacterNetwork.REQUIRED_COLUMNS)

                # 1. Apply previously known fixes
                dfr = df.copy()
                dfr["character"] = dfr.groupby("play_name")["character"].transform(
                    lambda s: s.replace(
                        CharacterNetwork.KNOWN_CHARACTER_FIXES.get(s.name) or {}
                    )
                )

                # 2. Warn if there are any candidate fixes not previously known
                play_mappings = dfr.groupby("play_name").apply(
                    lambda group_df: calculate_candidate_character_replacements(
                        group_df["character"], min_similarity_score=min_similarity_score
                    )
                )

                assert isinstance(play_mappings, pd.Series)

                play_mappings = {
                    play: {
                        original: replacement
                        for original, replacement in replacements.items()
                        if (play, original) not in CharacterNetwork.KNOWN_CHARACTER_NON_FIXES
                    }
                    for play, replacements in play_mappings.items()
                }
                for play, replacements in play_mappings.items():
                    if replacements:
                        warnings.warn(
                            f"Candidate character replacements found in play {play}: {replacements}"
                        )

                assert set(dfr.columns) == set(CharacterNetwork.REQUIRED_COLUMNS)

                # Remove entries with names not referring to definite characters
                dfr = dfr[~dfr['character'].isin(CharacterNetwork.INDEFINITE_NAMES)]

                return dfr

            @staticmethod
            def _build_shakespeare_network(df: pd.DataFrame) -> nx.Graph:
                assert set(df.columns) == set(CharacterNetwork.REQUIRED_COLUMNS)

                # Add the number of unique scenes.
                scenes_per_character = (
                    df.groupby(["play_name", "character", "act", "scene"])
                    .size()
                    .reset_index(name="_count")
                    .groupby(["play_name", "character"])
                    .size()
                    .reset_index(name="num_scenes")
                )

                # Group by play, character, and sex to get a summary for each character node.
                character_data = (
                    df.groupby(["play_name", "character", "sex"])
                    .agg(num_sentences=("sentence", "count"), num_acts=("act", "nunique"))
                    .reset_index()
                ).merge(scenes_per_character, on=["play_name", "character"])

                # Prepare a dictionary for node attributes, keyed by the unique node ID.
                node_attributes: dict[tuple[str, str], dict[str, Any]] = {}
                for _, row in character_data.iterrows():
                    node_id = (row["play_name"], row["character"])
                    node_attributes[node_id] = {
                        "play": row["play_name"],
                        "character": row["character"],
                        "sex": row["sex"],
                        "acts": row["num_acts"],
                        "scenes": row["num_scenes"],
                        "sentences": row["num_sentences"],
                    }
                # Process Edge Data
                interactions = (
                    df.groupby(["play_name", "act", "scene"])["character"]
                    .apply(set)
                    .reset_index(name="characters_in_scene")
                )

                edge_attributes: dict[tuple[str, str, str], dict[str, Any]] = {}

                sentences_by_scene_and_character = df.groupby(
                    ["play_name", "act", "scene", "character"]
                ).size()
                for _, row in interactions.iterrows():
                    play_name = row["play_name"]
                    act = row["act"]
                    scene = row["scene"]
                    characters_in_scene = row["characters_in_scene"]

                    # Get all unique pairs of characters in this scene.
                    for char1, char2 in combinations(set(characters_in_scene), 2):
                        edge_key = (play_name, char1, char2)
                        sentences_char1 = sentences_by_scene_and_character.loc[
                            play_name, act, scene, char1
                        ]
                        sentences_char2 = sentences_by_scene_and_character.loc[
                            play_name, act, scene, char2
                        ]
                        if edge_key not in edge_attributes:
                            edge_attributes[edge_key] = {
                                "play_name": play_name,
                                "interactions": [],
                            }
                        edge_attributes[edge_key]["interactions"].append(
                            {
                                "act": act,
                                "scene": scene,
                                "sentences_char1": int(sentences_char1),
                                "sentences_char2": int(sentences_char2),
                            }
                        )

                # Build the NetworkX Graph
                G = nx.Graph()

                for node_id, attributes in node_attributes.items():
                    G.add_node(node_id, **attributes)

                for edge_key, attributes in edge_attributes.items():
                    play, char1, char2 = edge_key
                    G.add_edge((play, char1), (play, char2), **attributes)

                return G


        # Example usage:
        # character_network = CharacterNetwork(pd.read_csv(data_dir / 'shakespeare_plays.csv'))
        # play_names = character_network.play_names
        # sdg = character_network.graph
        # print(f"jm - {sdg=}")
      #+end_src

