navigator.html
<div id="outline-container-org0bcf899" class="outline-3">
<h3 id="org0bcf899">Data providers</h3>
<div class="outline-text-3" id="text-org0bcf899">
</div>
<div id="outline-container-orga5dc3f8" class="outline-4">
<h4 id="orga5dc3f8">Shakespeare data</h4>
<div class="outline-text-4" id="text-orga5dc3f8">
<div class="org-src-container">
<pre class="src src-python" id="org684f37b"><span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-keyword">import</span> networkx <span class="org-keyword">as</span> nx
<span class="org-keyword">from</span> itertools <span class="org-keyword">import</span> combinations
<span class="org-keyword">from</span> typing <span class="org-keyword">import</span> Any


<span class="org-keyword">class</span> <span class="org-type">CharacterNetwork</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, df: pd.DataFrame):
        <span class="org-doc">"""Initializes the CharacterNetwork with a dataframe containing character</span>
<span class="org-doc">        interactions in Shakespeare's plays.</span>

<span class="org-doc">        Nodes represent a unique character within a specific play (e.g., 'play-name-character').</span>
<span class="org-doc">        Edges connect characters who speak in the same scene.</span>

<span class="org-doc">        Args:</span>
<span class="org-doc">            df: The dataframe, with columns:</span>
<span class="org-doc">            - play_name</span>
<span class="org-doc">            - genre</span>
<span class="org-doc">            - act</span>
<span class="org-doc">            - scene</span>
<span class="org-doc">            - character</span>
<span class="org-doc">            - sex</span>
<span class="org-doc">            - sentence</span>
<span class="org-doc">            - text</span>
<span class="org-doc">        """</span>
        <span class="org-keyword">self</span>.<span class="org-variable-name">df</span> <span class="org-operator">=</span> df
        <span class="org-keyword">self</span>.<span class="org-variable-name">graph</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>._build_shakespeare_network(<span class="org-keyword">self</span>.df)
        <span class="org-keyword">self</span>.<span class="org-variable-name">play_names</span> <span class="org-operator">=</span> <span class="org-builtin">sorted</span>(<span class="org-builtin">set</span>(df[<span class="org-string">"play_name"</span>]))

    @<span class="org-builtin">staticmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_build_shakespeare_network</span>(df: pd.DataFrame) <span class="org-operator">-&gt;</span> nx.Graph:
        <span class="org-variable-name">required_columns</span> <span class="org-operator">=</span> <span class="org-builtin">set</span>(
            <span class="org-string">"play_name,genre,character,act,scene,sentence,text,sex"</span>.split(<span class="org-string">","</span>)
        )
        <span class="org-keyword">assert</span> <span class="org-builtin">set</span>(df.columns) <span class="org-operator">&gt;</span> required_columns

        <span class="org-comment-delimiter"># </span><span class="org-comment">Add the number of unique scenes.</span>
        <span class="org-variable-name">scenes_per_character</span> <span class="org-operator">=</span> (
            df.groupby([<span class="org-string">"play_name"</span>, <span class="org-string">"character"</span>, <span class="org-string">"act"</span>, <span class="org-string">"scene"</span>])
            .size()
            .reset_index(name<span class="org-operator">=</span><span class="org-string">"_count"</span>)
            .groupby([<span class="org-string">"play_name"</span>, <span class="org-string">"character"</span>])
            .size()
            .reset_index(name<span class="org-operator">=</span><span class="org-string">"num_scenes"</span>)
        )

        <span class="org-comment-delimiter"># </span><span class="org-comment">Group by play, character, and sex to get a summary for each character node.</span>
        <span class="org-variable-name">character_data</span> <span class="org-operator">=</span> ((
            df.groupby([<span class="org-string">"play_name"</span>, <span class="org-string">"character"</span>, <span class="org-string">"sex"</span>])
            .agg(num_sentences<span class="org-operator">=</span>(<span class="org-string">"sentence"</span>, <span class="org-string">"count"</span>), num_acts<span class="org-operator">=</span>(<span class="org-string">"act"</span>, <span class="org-string">"nunique"</span>))
            .reset_index()
        ).merge(
            scenes_per_character, on<span class="org-operator">=</span>[<span class="org-string">"play_name"</span>, <span class="org-string">"character"</span>]
        ))

        <span class="org-comment-delimiter"># </span><span class="org-comment">Prepare a dictionary for node attributes, keyed by the unique node ID.</span>
        <span class="org-variable-name">node_attributes</span>: <span class="org-builtin">dict</span>[<span class="org-builtin">tuple</span>[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>], <span class="org-builtin">dict</span>[<span class="org-builtin">str</span>, <span class="org-type">Any</span>]] <span class="org-operator">=</span> {}
        <span class="org-keyword">for</span> _, row <span class="org-keyword">in</span> character_data.iterrows():
            <span class="org-variable-name">node_id</span> <span class="org-operator">=</span> (row[<span class="org-string">"play_name"</span>], row[<span class="org-string">"character"</span>])
            <span class="org-variable-name">node_attributes</span>[node_id] <span class="org-operator">=</span> {
                <span class="org-string">"play"</span>: row[<span class="org-string">"play_name"</span>],
                <span class="org-string">"character"</span>: row[<span class="org-string">"character"</span>],
                <span class="org-string">"sex"</span>: row[<span class="org-string">"sex"</span>],
                <span class="org-string">"acts"</span>: row[<span class="org-string">"num_acts"</span>],
                <span class="org-string">"scenes"</span>: row[<span class="org-string">"num_scenes"</span>],
                <span class="org-string">"sentences"</span>: row[<span class="org-string">"num_sentences"</span>],
            }
        <span class="org-comment-delimiter"># </span><span class="org-comment">Process Edge Data</span>
        <span class="org-variable-name">interactions</span> <span class="org-operator">=</span> (
            df.groupby([<span class="org-string">"play_name"</span>, <span class="org-string">"act"</span>, <span class="org-string">"scene"</span>])[<span class="org-string">"character"</span>]
            .<span class="org-builtin">apply</span>(<span class="org-builtin">set</span>)
            .reset_index(name<span class="org-operator">=</span><span class="org-string">"characters_in_scene"</span>)
        )

        <span class="org-variable-name">edge_attributes</span>: <span class="org-builtin">dict</span>[<span class="org-builtin">tuple</span>[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>, <span class="org-builtin">str</span>], <span class="org-builtin">dict</span>[<span class="org-builtin">str</span>, <span class="org-type">Any</span>]] <span class="org-operator">=</span> {}

        <span class="org-variable-name">sentences_by_scene_and_character</span> <span class="org-operator">=</span> df.groupby(
            [<span class="org-string">"play_name"</span>, <span class="org-string">"act"</span>, <span class="org-string">"scene"</span>, <span class="org-string">"character"</span>]
        ).size()
        <span class="org-keyword">for</span> _, row <span class="org-keyword">in</span> interactions.iterrows():
            <span class="org-variable-name">play_name</span> <span class="org-operator">=</span> row[<span class="org-string">"play_name"</span>]
            <span class="org-variable-name">act</span> <span class="org-operator">=</span> row[<span class="org-string">"act"</span>]
            <span class="org-variable-name">scene</span> <span class="org-operator">=</span> row[<span class="org-string">"scene"</span>]
            <span class="org-variable-name">characters_in_scene</span> <span class="org-operator">=</span> row[<span class="org-string">"characters_in_scene"</span>]

            <span class="org-comment-delimiter"># </span><span class="org-comment">Get all unique pairs of characters in this scene.</span>
            <span class="org-keyword">for</span> char1, char2 <span class="org-keyword">in</span> combinations(<span class="org-builtin">set</span>(characters_in_scene), 2):
                <span class="org-variable-name">edge_key</span> <span class="org-operator">=</span> (play_name, char1, char2)
                <span class="org-variable-name">sentences_char1</span> <span class="org-operator">=</span> sentences_by_scene_and_character.loc[
                    play_name, act, scene, char1
                ]
                <span class="org-variable-name">sentences_char2</span> <span class="org-operator">=</span> sentences_by_scene_and_character.loc[
                    play_name, act, scene, char2
                ]
                <span class="org-keyword">if</span> edge_key <span class="org-keyword">not</span> <span class="org-keyword">in</span> edge_attributes:
                    <span class="org-variable-name">edge_attributes</span>[edge_key] <span class="org-operator">=</span> {
                        <span class="org-string">"play_name"</span>: play_name,
                        <span class="org-string">"interactions"</span>: [],
                    }
                edge_attributes[edge_key][<span class="org-string">"interactions"</span>].append(
                    {
                        <span class="org-string">"act"</span>: act,
                        <span class="org-string">"scene"</span>: scene,
                        <span class="org-string">"sentences_char1"</span>: sentences_char1,
                        <span class="org-string">"sentences_char2"</span>: sentences_char2,
                    }
                )

        <span class="org-comment-delimiter"># </span><span class="org-comment">Build the NetworkX Graph</span>
        <span class="org-variable-name">G</span> <span class="org-operator">=</span> nx.Graph()

        <span class="org-keyword">for</span> node_id, attributes <span class="org-keyword">in</span> node_attributes.items():
            G.add_node(node_id, <span class="org-operator">**</span>attributes)
        <span class="org-variable-name">dn</span> <span class="org-operator">=</span> G.nodes[(<span class="org-string">"Winter's Tale"</span>, <span class="org-string">"Time"</span>)]

        <span class="org-keyword">for</span> edge_key, attributes <span class="org-keyword">in</span> edge_attributes.items():
            <span class="org-variable-name">play</span>, <span class="org-variable-name">char1</span>, <span class="org-variable-name">char2</span> <span class="org-operator">=</span> edge_key
            G.add_edge((play, char1), (play, char2), <span class="org-operator">**</span>attributes)

        <span class="org-keyword">return</span> G


<span class="org-comment-delimiter"># </span><span class="org-comment">Example usage:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">character_network = CharacterNetwork(pd.read_csv(data_dir / 'shakespeare_plays.csv'))</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">play_names = character_network.play_names</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">sdg = character_network.graph</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">print(f"jm - {sdg=}")</span>
</pre>
</div>
</div>
</div>
</div>
</div>
