navigator.org
* Footnotes
  :PROPERTIES:
  :CUSTOM_ID: footnotes
  :ID:       56c9e160-adf1-48c9-b988-4de2fe60fab3
  :END:

[fn:cytoscapejs-and-cytoscape] Cytoscape.js and Cytoscape --- Cytoscape User Manual, [[https://manual.cytoscape.org/en/stable/Cytoscape.js_and_Cytoscape.html]]

[fn:shiny-custom-components] Custom components package -- Shiny for Python, [[https://shiny.posit.co/py/docs/custom-components-pkg.html]]

[fn:shiny-custom-js] Custom JavaScript component -- Shiny for Python, [[https://shiny.posit.co/py/docs/custom-component-one-off.html]]

[fn:shiny-overview] Overview -- Shiny for Python, [[https://shiny.posit.co/py/docs/overview.html]]

[fn:shiny-python-js] Shiny for Python and JavaScript: How to Add JS Scripts to Your Dashboards - Appsilon,
[[https://www.appsilon.com/post/shiny-for-python-javascript]]


* Local variables :noexport:
  :PROPERTIES:
  :ID:       f3c4191a-f21b-4c5f-80b2-213a6c590d49
  :END:
  ;; Local Variables:
  ;; eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
  ;; toc-org-max-depth: 3
  ;; End:
