navigator.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.shiny-overview" class="footnum" href="#fnr.shiny-overview" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Overview &#x2013; Shiny for Python, <a href="https://shiny.posit.co/py/docs/overview.html">https://shiny.posit.co/py/docs/overview.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.cytoscapejs-and-cytoscape" class="footnum" href="#fnr.cytoscapejs-and-cytoscape" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Cytoscape.js and Cytoscape &#x2014; Cytoscape User Manual, <a href="https://manual.cytoscape.org/en/stable/Cytoscape.js_and_Cytoscape.html">https://manual.cytoscape.org/en/stable/Cytoscape.js_and_Cytoscape.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.shiny-python-js" class="footnum" href="#fnr.shiny-python-js" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Shiny for Python and JavaScript: How to Add JS Scripts to Your Dashboards - Appsilon,
<a href="https://www.appsilon.com/post/shiny-for-python-javascript">https://www.appsilon.com/post/shiny-for-python-javascript</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.shiny-custom-js" class="footnum" href="#fnr.shiny-custom-js" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Custom JavaScript component &#x2013; Shiny for Python, <a href="https://shiny.posit.co/py/docs/custom-component-one-off.html">https://shiny.posit.co/py/docs/custom-component-one-off.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.shiny-custom-components" class="footnum" href="#fnr.shiny-custom-components" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Custom components package &#x2013; Shiny for Python, <a href="https://shiny.posit.co/py/docs/custom-components-pkg.html">https://shiny.posit.co/py/docs/custom-components-pkg.html</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Moore</p>
<p class="date">Created: 2025-08-06 Wed 00:31</p>
</div>
</body>
</html>
